#include "gen2/Gen2Common.h"
#include "gen2/Gen2GameReader.h"
#include "SaveManager.h"
#include "RomReader.h"
#include "utils.h"
#include "common.h"

#include <cstdlib>
#include <cstring>

#define POKEMON_GOLD_CARTRIDGE_TITLE "POKEMON_GLD"
#define POKEMON_SILVER_CARTRIDGE_TITLE "POKEMON_SLV"
#define POKEMON_CRYSTAL_CARTRIDGE_TITLE "PM_CRYSTAL"

uint16_t gen2_iconColorPalette[4] = {
	0x7FFF,
	0x2A5E,
	0x10FE,
	0x0
};

static uint8_t gen2_statsFingerPrint[] = {
	0x01, 0x2D, 0x31, 0x31, 0x2D, 0x41, 0x41, 0x16,
	0x03, 0x2D, 0x40, 0x00, 0x00, 0x1F, 0x64, 0x14
};

static TextCodePair gen2TextCodesMain[] = {
	{0x56, u8"……"},
	{0x5D, u8"TRAINER"},
	{0x60, u8"█"},
	{0x61, u8"▲"},
	{0x74, u8"・"},
	{0x75, u8"…"},
	{0x7F, u8" "},
	{0x80, u8"A"},
	{0x81, u8"B"},
	{0x82, u8"C"},
	{0x83, u8"D"},
	{0x84, u8"E"},
	{0x85, u8"F"},
	{0x86, u8"G"},
	{0x87, u8"H"},
	{0x88, u8"I"},
	{0x89, u8"J"},
	{0x8A, u8"K"},
	{0x8B, u8"L"},
	{0x8C, u8"M"},
	{0x8D, u8"N"},
	{0x8E, u8"O"},
	{0x8F, u8"P"},
	{0x90, u8"Q"},
	{0x91, u8"R"},
	{0x92, u8"S"},
	{0x93, u8"T"},
	{0x94, u8"U"},
	{0x95, u8"V"},
	{0x96, u8"W"},
	{0x97, u8"X"},
	{0x98, u8"Y"},
	{0x99, u8"Z"},
	{0x9A, u8"("},
	{0x9B, u8")"},
	{0x9C, u8":"},
	{0x9D, u8";"},
	{0x9E, u8"["},
	{0x9F, u8"]"},
	{0xA0, u8"a"},
	{0xA1, u8"b"},
	{0xA2, u8"c"},
	{0xA3, u8"d"},
	{0xA4, u8"e"},
	{0xA5, u8"f"},
	{0xA6, u8"g"},
	{0xA7, u8"h"},
	{0xA8, u8"i"},
	{0xA9, u8"j"},
	{0xAA, u8"k"},
	{0xAB, u8"l"},
	{0xAC, u8"m"},
	{0xAD, u8"n"},
	{0xAE, u8"o"},
	{0xAF, u8"p"},
	{0xB0, u8"q"},
	{0xB1, u8"r"},
	{0xB2, u8"s"},
	{0xB3, u8"t"},
	{0xB4, u8"u"},
	{0xB5, u8"v"},
	{0xB6, u8"w"},
	{0xB7, u8"x"},
	{0xB8, u8"y"},
	{0xB9, u8"z"},
	{0xBA, u8"à"},
	{0xBB, u8"è"},
	{0xBD, u8"ù"},
	{0xBE, u8"ß"},
	{0xBF, u8"ç"},
	{0xC0, u8"Ä"},
	{0xC1, u8"Ö"},
	{0xC2, u8"Ü"},
	{0xC3, u8"ä"},
	{0xC4, u8"ö"},
	{0xC5, u8"ü"},
	{0xC6, u8"ë"},
	{0xC7, u8"ï"},
	{0xC8, u8"â"},
	{0xC9, u8"ô"},
	{0xCA, u8"û"},
	{0xCB, u8"ê"},
	{0xCC, u8"î"},
	{0xD0, u8"'d"},
	{0xD1, u8"'l"},
	{0xD2, u8"'m"},
	{0xD3, u8"'r"},
	{0xD4, u8"'s"},
	{0xD5, u8"'t"},
	{0xD6, u8"'v"},
	{0xE0, u8"\'"},
	{0xE1, u8"PK"},
	{0xE2, u8"MN"},
	{0xE3, u8"-"},
	{0xE6, u8"?"},
	{0xE7, u8"!"},
	{0xE8, u8"."},
	{0xE9, u8"&"},
	{0xEA, u8"é"},
	{0xEB, u8"🡆"},
	{0xEC, u8"▷"},
	{0xED, u8"▶"},
	{0xEE, u8"▼"},
	{0xEF, u8"♂"},
	{0xF0, u8"¥"},
	{0xF1, u8"×"},
	{0xF3, u8"/"},
	{0xF4, u8","},
	{0xF5, u8"♀"},
	{0xF6, u8"0"},
	{0xF7, u8"1"},
	{0xF8, u8"2"},
	{0xF9, u8"3"},
	{0xFA, u8"4"},
	{0xFB, u8"5"},
	{0xFC, u8"6"},
	{0xFD, u8"7"},
	{0xFE, u8"8"},
	{0xFF, u8"9"},
	{0x51, u8" "}
};

static const TextCodePair gen2TextCodesJpn[] = {
	{0x01, u8"イ゙"},
	{0x02, u8"ヴ"},
	{0x03, u8"エ゙"},
	{0x04, u8"オ゙"},
	{0x05, u8"ガ"},
	{0x06, u8"ギ"},
	{0x07, u8"グ"},
	{0x08, u8"ゲ"},
	{0x09, u8"ゴ"},
	{0x0A, u8"ザ"},
	{0x0B, u8"ジ"},
	{0x0C, u8"ズ"},
	{0x0D, u8"ゼ"},
	{0x0E, u8"ゾ"},
	{0x0F, u8"ダ"},
	{0x10, u8"ヂ"},
	{0x11, u8"ヅ"},
	{0x12, u8"デ"},
	{0x13, u8"ド"},
	{0x14, u8"ナ゙"},
	{0x15, u8"ニ゙"},
	{0x16, u8"ヌ゙"},
	{0x17, u8"ネ゙"},
	{0x18, u8"ノ゙"},
	{0x19, u8"バ"},
	{0x1A, u8"ビ"},
	{0x1B, u8"ブ"},
	{0x1C, u8"ボ"},
	{0x1D, u8"マ゙"},
	{0x1E, u8"ミ゙"},
	{0x1F, u8"ム゙"},
	{0x20, u8"ィ゙"},
	{0x21, u8"あ゙"},
	{0x22, u8"い゙"},
	{0x23, u8"ゔ"},
	{0x24, u8"え゙"},
	{0x25, u8"お゙"},
	{0x26, u8"が"},
	{0x27, u8"ぎ"},
	{0x28, u8"ぐ"},
	{0x29, u8"げ"},
	{0x2A, u8"ご"},
	{0x2B, u8"ざ"},
	{0x2C, u8"じ"},
	{0x2D, u8"ず"},
	{0x2E, u8"ぜ"},
	{0x2F, u8"ぞ"},
	{0x30, u8"だ"},
	{0x31, u8"ぢ"},
	{0x32, u8"づ"},
	{0x33, u8"で"},
	{0x34, u8"ど"},
	{0x35, u8"な゙"},
	{0x36, u8"に゙"},
	{0x37, u8"ぬ゙"},
	{0x38, u8"ね゙"},
	{0x39, u8"の゙"},
	{0x3A, u8"ば"},
	{0x3B, u8"び"},
	{0x3C, u8"ぶ"},
	{0x3D, u8"べ"},
	{0x3E, u8"ぼ"},
	{0x3F, u8"ま゙"},
	{0x40, u8"パ"},
	{0x41, u8"ピ"},
	{0x42, u8"プ"},
	{0x43, u8"ポ"},
	{0x44, u8"ぱ"},
	{0x45, u8"ぴ"},
	{0x46, u8"ぷ"},
	{0x47, u8"ぺ"},
	{0x48, u8"ぽ"},
	{0x49, u8"ま゚"},
	{0x4D, u8"も゚"},
	{0x4F, u8" "},
	{0x57, u8"#"},
	{0x51, u8"*"},
	{0x52, u8"A1"},
	{0x53, u8"A2"},
	{0x54, u8"POKé"},
	{0x55, u8"+"},
	{0x58, u8"$"},
	{0x5D, u8"TRAINER"},
	{0x75, u8"…"},
	{0x7F, u8" "},
	{0x60, u8"A"},
	{0x61, u8"▲"},
	{0x62, u8"?"},
	{0x63, u8"D"},
	{0x64, u8"E"},
	{0x65, u8"F"},
	{0x66, u8"G"},
	{0x67, u8"H"},
	{0x68, u8"I"},
	{0x69, u8"V"},
	{0x6A, u8"S"},
	{0x6B, u8"L"},
	{0x6C, u8"M"},
	{0x6D, u8"："},
	{0x6E, u8"ぃ"},
	{0x6F, u8"ぅ"},
	{0x70, u8"「"},
	{0x71, u8"」"},
	{0x72, u8"『"},
	{0x73, u8"』"},
	{0x74, u8"・"},
	{0x75, u8"…"},
	{0x76, u8"ぁ"},
	{0x77, u8"ぇ"},
	{0x78, u8"ぉ"},
	{0x80, u8"ア"},
	{0x81, u8"イ"},
	{0x82, u8"ウ"},
	{0x83, u8"エ"},
	{0x84, u8"オ"},
	{0x85, u8"カ"},
	{0x86, u8"キ"},
	{0x87, u8"ク"},
	{0x88, u8"ケ"},
	{0x89, u8"コ"},
	{0x8A, u8"サ"},
	{0x8B, u8"シ"},
	{0x8C, u8"ス"},
	{0x8D, u8"セ"},
	{0x8E, u8"ソ"},
	{0x8F, u8"タ"},
	{0x90, u8"チ"},
	{0x91, u8"ツ"},
	{0x92, u8"テ"},
	{0x93, u8"ト"},
	{0x94, u8"ナ"},
	{0x95, u8"ニ"},
	{0x96, u8"ヌ"},
	{0x97, u8"ネ"},
	{0x98, u8"ノ"},
	{0x99, u8"ハ"},
	{0x9A, u8"ヒ"},
	{0x9B, u8"フ"},
	{0x9C, u8"ホ"},
	{0x9D, u8"マ"},
	{0x9E, u8"ミ"},
	{0x9F, u8"ム"},
	{0xA0, u8"メ"},
	{0xA1, u8"モ"},
	{0xA2, u8"ヤ"},
	{0xA3, u8"ユ"},
	{0xA4, u8"ヨ"},
	{0xA5, u8"ラ"},
	{0xA6, u8"ル"},
	{0xA7, u8"レ"},
	{0xA8, u8"ロ"},
	{0xA9, u8"ワ"},
	{0xAA, u8"ヲ"},
	{0xAB, u8"ン"},
	{0xAC, u8"ッ"},
	{0xAD, u8"ャ"},
	{0xAE, u8"ュ"},
	{0xAF, u8"ョ"},
	{0xB0, u8"ィ"},
	{0xB1, u8"あ"},
	{0xB2, u8"い"},
	{0xB3, u8"う"},
	{0xB4, u8"え"},
	{0xB5, u8"お"},
	{0xB6, u8"か"},
	{0xB7, u8"き"},
	{0xB8, u8"く"},
	{0xB9, u8"け"},
	{0xBA, u8"こ"},
	{0xBB, u8"さ"},
	{0xBC, u8"し"},
	{0xBD, u8"す"},
	{0xBE, u8"せ"},
	{0xBF, u8"そ"},
	{0xC0, u8"た"},
	{0xC1, u8"ち"},
	{0xC2, u8"つ"},
	{0xC3, u8"て"},
	{0xC4, u8"と"},
	{0xC5, u8"な"},
	{0xC6, u8"に"},
	{0xC7, u8"ぬ"},
	{0xC8, u8"ね"},
	{0xC9, u8"の"},
	{0xCA, u8"は"},
	{0xCB, u8"ひ"},
	{0xCC, u8"ふ"},
	{0xCD, u8"へ"},
	{0xCE, u8"ほ"},
	{0xCF, u8"ま"},
	{0xD0, u8"み"},
	{0xD1, u8"む"},
	{0xD2, u8"め"},
	{0xD3, u8"も"},
	{0xD4, u8"や"},
	{0xD5, u8"ゆ"},
	{0xD6, u8"よ"},
	{0xD7, u8"ら"},
	{0xD8, u8"リ"},
	{0xD9, u8"る"},
	{0xDA, u8"れ"},
	{0xDB, u8"ろ"},
	{0xDC, u8"わ"},
	{0xDD, u8"を"},
	{0xDE, u8"ん"},
	{0xDF, u8"っ"},
	{0xE0, u8"ゃ"},
	{0xE1, u8"ゅ"},
	{0xE2, u8"ょ"},
	{0xE3, u8"ー"},
	{0xE4, u8"゜"},
	{0xE5, u8"゛"},
	{0xE6, u8"?"},
	{0xE7, u8"!"},
	{0xE8, u8"。"},
	{0xE9, u8"ァ"},
	{0xEA, u8"ゥ"},
	{0xEB, u8"ェ"},
	{0xEC, u8"▷"},
	{0xED, u8"▶"},
	{0xEE, u8"▼"},
	{0xEF, u8"♂"},
	{0xF0, u8"円"},
	{0xF1, u8"×"},
	{0xF2, u8"."},
	{0xF3, u8"/"},
	{0xF4, u8"ォ"},
	{0xF5, u8"♀"},
	{0xF6, u8"0"},
	{0xF7, u8"1"},
	{0xF8, u8"2"},
	{0xF9, u8"3"},
	{0xFA, u8"4"},
	{0xFB, u8"5"},
	{0xFC, u8"6"},
	{0xFD, u8"7"},
	{0xFE, u8"8"},
	{0xFF, u8"9"}
};

// Based on https://bulbapedia.bulbagarden.net/wiki/Korean_character_encoding_(Generation_II)#Character_map

static const TextCodePair gen2TextCodesKorean0[] = {
	{0x00, u8"ㄱ"},
	{0x01, u8"ㄴ"},
	{0x02, u8"ㄷ"},
	{0x03, u8"ㄹ"},
	{0x04, u8"ㅁ"},
	{0x05, u8"ㅂ"},
	{0x06, u8"ㅅ"},
	{0x07, u8"ㅇ"},
	{0x08, u8"ㅈ"},
	{0x09, u8"ㅊ"},
	{0x0A, u8"ㅋ"},
	{0x0B, u8"ㅌ"},
	{0x0C, u8"ㅍ"},
	{0x0D, u8"ㅎ"},
	{0x0E, u8"ㄲ"},
	{0x0F, u8"ㄸ"},
	{0x10, u8"ㅃ"},
	{0x11, u8"ㅆ"},
	{0x12, u8"ㅉ"},
	{0x20, u8"ㅏ"},
	{0x21, u8"ㅑ"},
	{0x22, u8"ㅓ"},
	{0x23, u8"ㅕ"},
	{0x24, u8"ㅗ"},
	{0x25, u8"ㅛ"},
	{0x26, u8"ㅜ"},
	{0x27, u8"ㅠ"},
	{0x28, u8"ㅡ"},
	{0x29, u8"ㅣ"},
	{0x2A, u8"ㅐ"},
	{0x2B, u8"ㅒ"},
	{0x2C, u8"ㅔ"},
	{0x2D, u8"ㅖ"},
	{0x2E, u8"ㅘ"},
	{0x2F, u8"ㅙ"},
	{0x30, u8"ㅚ"},
	{0x31, u8"ㅝ"},
	{0x32, u8"ㅞ"},
	{0x33, u8"ㅟ"},
	{0x34, u8"ㅢ"},
	{0x3E, u8"_"},
	{0x3F, u8"-"},
	{0x60, u8"「"},
	{0x61, u8"」"},
	{0x62, u8"『"},
	{0x63, u8"』"},
	{0x64, u8"("},
	{0x65, u8")"},
	{0x66, u8"!"},
	{0x67, u8"?"},
	{0x68, u8"-"},
	{0x69, u8"~"},
	{0x6A, u8"…"},
	{0x6B, u8","},
	{0x6C, u8"."},
	{0xF0, u8"0"},
	{0xF1, u8"1"},
	{0xF2, u8"2"},
	{0xF3, u8"3"},
	{0xF4, u8"4"},
	{0xF5, u8"5"},
	{0xF6, u8"6"},
	{0xF7, u8"7"},
	{0xF8, u8"8"},
	{0xF9, u8"9"}
};

static const TextCodePair gen2TextCodesKorean1[] = {
	{0x01, u8"가"},
	{0x02, u8"각"},
	{0x03, u8"간"},
	{0x04, u8"갇"},
	{0x05, u8"갈"},
	{0x06, u8"갉"},
	{0x07, u8"갊"},
	{0x08, u8"감"},
	{0x09, u8"갑"},
	{0x0A, u8"값"},
	{0x0B, u8"갓"},
	{0x0C, u8"갔"},
	{0x0D, u8"강"},
	{0x0E, u8"갖"},
	{0x0F, u8"갗"},
	{0x10, u8"같"},
	{0x11, u8"갚"},
	{0x12, u8"갛"},
	{0x13, u8"개"},
	{0x14, u8"객"},
	{0x15, u8"갠"},
	{0x16, u8"갤"},
	{0x17, u8"갬"},
	{0x18, u8"갭"},
	{0x19, u8"갯"},
	{0x1A, u8"갰"},
	{0x1B, u8"갱"},
	{0x1C, u8"갸"},
	{0x1D, u8"갹"},
	{0x1E, u8"갼"},
	{0x1F, u8"걀"},
	{0x20, u8"걀"},
	{0x21, u8"걍"},
	{0x22, u8"걔"},
	{0x23, u8"걘"},
	{0x24, u8"걜"},
	{0x25, u8"거"},
	{0x26, u8"걱"},
	{0x27, u8"건"},
	{0x28, u8"걷"},
	{0x29, u8"걸"},
	{0x2A, u8"걺"},
	{0x2B, u8"검"},
	{0x2C, u8"겁"},
	{0x2D, u8"것"},
	{0x2E, u8"겄"},
	{0x2F, u8"겅"},
	{0x30, u8"겆"},
	{0x31, u8"겉"},
	{0x32, u8"겊"},
	{0x33, u8"겋"},
	{0x34, u8"게"},
	{0x35, u8"겐"},
	{0x36, u8"겔"},
	{0x37, u8"겜"},
	{0x38, u8"겝"},
	{0x39, u8"겟"},
	{0x3A, u8"겠"},
	{0x3B, u8"겡"},
	{0x3C, u8"겨"},
	{0x3D, u8"격"},
	{0x3E, u8"겪"},
	{0x3F, u8"견"},
	{0x40, u8"겯"},
	{0x41, u8"결"},
	{0x42, u8"겹"},
	{0x43, u8"겸"},
	{0x44, u8"겻"},
	{0x45, u8"겼"},
	{0x46, u8"경"},
	{0x47, u8"곁"},
	{0x48, u8"계"},
	{0x49, u8"곈"},
	{0x4A, u8"곌"},
	{0x4B, u8"곕"},
	{0x4C, u8"곗"},
	{0x4D, u8"고"},
	{0x4E, u8"곡"},
	{0x4F, u8"곤"},
	{0x60, u8"곧"},
	{0x61, u8"골"},
	{0x62, u8"곪"},
	{0x63, u8"곬"},
	{0x64, u8"곯"},
	{0x65, u8"곰"},
	{0x66, u8"곱"},
	{0x67, u8"곳"},
	{0x68, u8"공"},
	{0x69, u8"곶"},
	{0x6A, u8"과"},
	{0x6B, u8"곽"},
	{0x6C, u8"관"},
	{0x6D, u8"괄"},
	{0x6E, u8"괆"},
	{0x71, u8"괌"},
	{0x72, u8"괍"},
	{0x73, u8"괏"},
	{0x74, u8"광"},
	{0x75, u8"괘"},
	{0x76, u8"괜"},
	{0x77, u8"괠"},
	{0x78, u8"괩"},
	{0x79, u8"괩"},
	{0x7A, u8"괭"},
	{0x7B, u8"괴"},
	{0x7C, u8"괵"},
	{0x7D, u8"괸"},
	{0x7E, u8"괼"},
	{0x7F, u8"괻"},
	{0x80, u8"굅"},
	{0x81, u8"굇"},
	{0x82, u8"굉"},
	{0x83, u8"교"},
	{0x84, u8"굔"},
	{0x85, u8"굘"},
	{0x86, u8"굡"},
	{0x87, u8"굣"},
	{0x88, u8"구"},
	{0x89, u8"국"},
	{0x8A, u8"군"},
	{0x8B, u8"굳"},
	{0x8C, u8"굴"},
	{0x8D, u8"굵"},
	{0x8E, u8"굶"},
	{0x8F, u8"굻"},
	{0x90, u8"굼"},
	{0x91, u8"굽"},
	{0x92, u8"굿"},
	{0x93, u8"궁"},
	{0x94, u8"궂"},
	{0x95, u8"궈"},
	{0x96, u8"궉"},
	{0x97, u8"권"},
	{0x98, u8"궐"},
	{0x99, u8"궜"},
	{0x9A, u8"궝"},
	{0x9B, u8"궤"},
	{0x9C, u8"궷"},
	{0x9D, u8"귀"},
	{0x9E, u8"귁"},
	{0x9F, u8"귄"},
	{0xA0, u8"귈"},
	{0xA1, u8"귐"},
	{0xA2, u8"귑"},
	{0xA3, u8"귓"},
	{0xA4, u8"규"},
	{0xA5, u8"균"},
	{0xA6, u8"귤"},
	{0xA7, u8"그"},
	{0xA8, u8"극"},
	{0xA9, u8"근"},
	{0xAA, u8"귿"},
	{0xAB, u8"글"},
	{0xAC, u8"긁"},
	{0xAD, u8"금"},
	{0xAE, u8"급"},
	{0xAF, u8"긋"},
	{0xB0, u8"긍"},
	{0xB1, u8"긔"},
	{0xB2, u8"기"},
	{0xB3, u8"긱"},
	{0xB4, u8"긴"},
	{0xB5, u8"긷"},
	{0xB6, u8"길"},
	{0xB7, u8"긺"},
	{0xB8, u8"김"},
	{0xB9, u8"깁"},
	{0xBA, u8"깃"},
	{0xBB, u8"깅"},
	{0xBC, u8"깆"},
	{0xBD, u8"깊"},
	{0xBE, u8"까"},
	{0xBF, u8"깍"},
	{0xC0, u8"깎"},
	{0xC1, u8"깐"},
	{0xC2, u8"깔"},
	{0xC3, u8"깖"},
	{0xC4, u8"깜"},
	{0xC5, u8"깝"},
	{0xC6, u8"깟"},
	{0xC7, u8"깠"},
	{0xC8, u8"깡"},
	{0xC9, u8"깥"},
	{0xCA, u8"깨"},
	{0xCB, u8"깩"},
	{0xCC, u8"깬"},
	{0xCD, u8"깰"},
	{0xCE, u8"깸"},
	{0xD1, u8"깹"},
	{0xD2, u8"깻"},
	{0xD3, u8"깼"},
	{0xD4, u8"깽"},
	{0xD5, u8"꺄"},
	{0xD6, u8"꺅"},
	{0xD7, u8"꺌"},
	{0xD8, u8"꺼"},
	{0xD9, u8"꺽"},
	{0xDA, u8"꺾"},
	{0xDB, u8"껀"},
	{0xDC, u8"껄"},
	{0xDD, u8"껌"},
	{0xDE, u8"껍"},
	{0xDF, u8"껏"},
	{0xE0, u8"껐"},
	{0xE1, u8"껑"},
	{0xE2, u8"께"},
	{0xE3, u8"껙"},
	{0xE4, u8"껜"},
	{0xE5, u8"껨"},
	{0xE6, u8"껫"},
	{0xE7, u8"껭"},
	{0xE8, u8"껴"},
	{0xE9, u8"껸"},
	{0xEA, u8"껼"},
	{0xEB, u8"꼇"},
	{0xEC, u8"꼈"},
	{0xED, u8"꼍"},
	{0xEE, u8"꼐"},
	{0xEF, u8"꼬"},
	{0xF0, u8"꼭"},
	{0xF1, u8"꼰"},
	{0xF2, u8"꼲"},
	{0xF3, u8"꼴"},
	{0xF4, u8"꼼"},
	{0xF5, u8"꼽"},
	{0xF6, u8"꼿"},
	{0xF7, u8"꽁"},
	{0xF8, u8"꽂"},
	{0xF9, u8"꽃"},
	{0xFA, u8"꽈"},
	{0xFB, u8"꽉"},
	{0xFC, u8"꽐"},
	{0xFD, u8"꽜"},
	{0xFE, u8"꽝"},
	{0xFF, u8"꽤"}
};

static const TextCodePair gen2TextCodesKorean2[] = {
	{0x00, u8"꽥"},
	{0x01, u8"꽹"},
	{0x02, u8"꾀"},
	{0x03, u8"꾄"},
	{0x04, u8"꾈"},
	{0x05, u8"꾐"},
	{0x06, u8"꾑"},
	{0x07, u8"꾕"},
	{0x08, u8"꾜"},
	{0x09, u8"꾸"},
	{0x0A, u8"꾹"},
	{0x0B, u8"꾼"},
	{0x0C, u8"꿀"},
	{0x0D, u8"꿇"},
	{0x0E, u8"꿈"},
	{0x0F, u8"꿈"},
	{0x10, u8"꿋"},
	{0x11, u8"꿍"},
	{0x12, u8"꿎"},
	{0x13, u8"꿔"},
	{0x14, u8"꿜"},
	{0x15, u8"꿨"},
	{0x16, u8"꿩"},
	{0x17, u8"꿰"},
	{0x18, u8"꿱"},
	{0x19, u8"꿴"},
	{0x1A, u8"꿸"},
	{0x1B, u8"뀀"},
	{0x1C, u8"뀁"},
	{0x1D, u8"뀄"},
	{0x1E, u8"뀌"},
	{0x1F, u8"뀐"},
	{0x20, u8"뀔"},
	{0x21, u8"뀜"},
	{0x22, u8"뀝"},
	{0x23, u8"뀨"},
	{0x24, u8"끄"},
	{0x25, u8"끅"},
	{0x26, u8"끈"},
	{0x27, u8"끊"},
	{0x28, u8"끌"},
	{0x29, u8"끎"},
	{0x2A, u8"끓"},
	{0x2B, u8"끔"},
	{0x2C, u8"끕"},
	{0x2D, u8"끗"},
	{0x2E, u8"끙"},
	{0x31, u8"끝"},
	{0x32, u8"끼"},
	{0x33, u8"끽"},
	{0x34, u8"낀"},
	{0x35, u8"낄"},
	{0x36, u8"낌"},
	{0x37, u8"낍"},
	{0x38, u8"낏"},
	{0x39, u8"낑"},
	{0x3A, u8"나"},
	{0x3B, u8"낙"},
	{0x3C, u8"낚"},
	{0x3D, u8"난"},
	{0x3E, u8"낟"},
	{0x3F, u8"날"},
	{0x40, u8"낡"},
	{0x41, u8"낢"},
	{0x42, u8"남"},
	{0x43, u8"납"},
	{0x44, u8"낫"},
	{0x45, u8"났"},
	{0x46, u8"낭"},
	{0x47, u8"낮"},
	{0x48, u8"낯"},
	{0x49, u8"낱"},
	{0x4A, u8"낳"},
	{0x4B, u8"내"},
	{0x4C, u8"낵"},
	{0x4D, u8"낸"},
	{0x4E, u8"낼"},
	{0x4F, u8"냄"},
	{0x60, u8"냅"},
	{0x61, u8"냇"},
	{0x62, u8"냈"},
	{0x63, u8"냉"},
	{0x64, u8"냐"},
	{0x65, u8"냑"},
	{0x66, u8"냔"},
	{0x67, u8"냘"},
	{0x68, u8"냠"},
	{0x69, u8"냥"},
	{0x6A, u8"너"},
	{0x6B, u8"넉"},
	{0x6C, u8"넋"},
	{0x6D, u8"넌"},
	{0x6E, u8"널"},
	{0x6F, u8"넒"},
	{0x70, u8"넓"},
	{0x71, u8"넘"},
	{0x72, u8"넙"},
	{0x73, u8"넛"},
	{0x74, u8"넜"},
	{0x75, u8"넝"},
	{0x76, u8"넣"},
	{0x77, u8"네"},
	{0x78, u8"넥"},
	{0x79, u8"넨"},
	{0x7A, u8"넬"},
	{0x7B, u8"넴"},
	{0x7C, u8"넵"},
	{0x7D, u8"넷"},
	{0x7E, u8"넸"},
	{0x7F, u8"넹"},
	{0x80, u8"녀"},
	{0x81, u8"녁"},
	{0x82, u8"년"},
	{0x83, u8"녈"},
	{0x84, u8"념"},
	{0x85, u8"녑"},
	{0x86, u8"녔"},
	{0x87, u8"녕"},
	{0x88, u8"녘"},
	{0x89, u8"녜"},
	{0x8A, u8"녠"},
	{0x8B, u8"노"},
	{0x8C, u8"녹"},
	{0x8D, u8"논"},
	{0x8E, u8"놀"},
	{0x8F, u8"놂"},
	{0x90, u8"놈"},
	{0x91, u8"놉"},
	{0x92, u8"놋"},
	{0x93, u8"농"},
	{0x94, u8"높"},
	{0x95, u8"놓"},
	{0x96, u8"놔"},
	{0x97, u8"놘"},
	{0x98, u8"놜"},
	{0x99, u8"놨"},
	{0x9A, u8"뇌"},
	{0x9B, u8"뇐"},
	{0x9C, u8"뇔"},
	{0x9D, u8"뇜"},
	{0x9E, u8"뇝"},
	{0xA1, u8"뇟"},
	{0xA2, u8"뇨"},
	{0xA3, u8"뇩"},
	{0xA4, u8"뇬"},
	{0xA5, u8"뇰"},
	{0xA6, u8"뇹"},
	{0xA7, u8"뇻"},
	{0xA8, u8"뇽"},
	{0xA9, u8"누"},
	{0xAA, u8"눅"},
	{0xAB, u8"눈"},
	{0xAC, u8"눋"},
	{0xAD, u8"눌"},
	{0xAE, u8"눔"},
	{0xAF, u8"눕"},
	{0xB0, u8"눗"},
	{0xB1, u8"눙"},
	{0xB2, u8"눠"},
	{0xB3, u8"눴"},
	{0xB4, u8"눼"},
	{0xB5, u8"뉘"},
	{0xB6, u8"뉜"},
	{0xB7, u8"뉠"},
	{0xB8, u8"뉨"},
	{0xB9, u8"뉩"},
	{0xBA, u8"뉴"},
	{0xBB, u8"뉵"},
	{0xBC, u8"뉼"},
	{0xBD, u8"늄"},
	{0xBE, u8"늅"},
	{0xBF, u8"늉"},
	{0xC0, u8"느"},
	{0xC1, u8"늑"},
	{0xC2, u8"는"},
	{0xC3, u8"늘"},
	{0xC4, u8"늙"},
	{0xC5, u8"늚"},
	{0xC6, u8"늠"},
	{0xC7, u8"늡"},
	{0xC8, u8"늣"},
	{0xC9, u8"능"},
	{0xCA, u8"늦"},
	{0xCB, u8"늪"},
	{0xCC, u8"늬"},
	{0xCD, u8"늰"},
	{0xCE, u8"늴"},
	{0xCF, u8"니"},
	{0xD0, u8"닉"},
	{0xD1, u8"닌"},
	{0xD2, u8"닐"},
	{0xD3, u8"닒"},
	{0xD4, u8"님"},
	{0xD5, u8"닙"},
	{0xD6, u8"닛"},
	{0xD7, u8"닝"},
	{0xD8, u8"닢"},
	{0xD9, u8"다"},
	{0xDA, u8"닥"},
	{0xDB, u8"닦"},
	{0xDC, u8"단"},
	{0xDD, u8"닫"},
	{0xDE, u8"달"},
	{0xDF, u8"닭"},
	{0xE0, u8"닮"},
	{0xE1, u8"닯"},
	{0xE2, u8"닳"},
	{0xE3, u8"담"},
	{0xE4, u8"답"},
	{0xE5, u8"닷"},
	{0xE6, u8"닸"},
	{0xE7, u8"당"},
	{0xE8, u8"닺"},
	{0xE9, u8"닻"},
	{0xEA, u8"닿"},
	{0xEB, u8"대"},
	{0xEC, u8"댁"},
	{0xED, u8"댄"},
	{0xEE, u8"댈"},
	{0xEF, u8"댐"},
	{0xF0, u8"댑"},
	{0xF1, u8"댓"},
	{0xF2, u8"댔"},
	{0xF3, u8"댕"},
	{0xF5, u8"더"},
	{0xF6, u8"덕"},
	{0xF7, u8"덖"},
	{0xF8, u8"던"},
	{0xF9, u8"덛"},
	{0xFA, u8"덜"},
	{0xFB, u8"덞"},
	{0xFC, u8"덟"},
	{0xFD, u8"덤"},
	{0xFE, u8"덥"}
};

static const TextCodePair gen2TextCodesKorean3[] = {
	{0x01, u8"덧"},
	{0x02, u8"덩"},
	{0x03, u8"덫"},
	{0x04, u8"덮"},
	{0x05, u8"데"},
	{0x06, u8"덱"},
	{0x07, u8"덴"},
	{0x08, u8"델"},
	{0x09, u8"뎀"},
	{0x0A, u8"뎁"},
	{0x0B, u8"뎃"},
	{0x0C, u8"뎄"},
	{0x0D, u8"뎅"},
	{0x0E, u8"뎌"},
	{0x0F, u8"뎐"},
	{0x10, u8"뎔"},
	{0x11, u8"뎠"},
	{0x12, u8"뎡"},
	{0x13, u8"뎨"},
	{0x14, u8"뎬"},
	{0x15, u8"도"},
	{0x16, u8"독"},
	{0x17, u8"돈"},
	{0x18, u8"돋"},
	{0x19, u8"돌"},
	{0x1A, u8"돎"},
	{0x1C, u8"돔"},
	{0x1D, u8"돕"},
	{0x1E, u8"돗"},
	{0x1F, u8"동"},
	{0x20, u8"돛"},
	{0x21, u8"돝"},
	{0x22, u8"돠"},
	{0x23, u8"돤"},
	{0x24, u8"돨"},
	{0x25, u8"돼"},
	{0x26, u8"됐"},
	{0x27, u8"되"},
	{0x28, u8"된"},
	{0x29, u8"될"},
	{0x2A, u8"됨"},
	{0x2B, u8"됩"},
	{0x2C, u8"됫"},
	{0x2D, u8"됴"},
	{0x2E, u8"두"},
	{0x2F, u8"둑"},
	{0x30, u8"둔"},
	{0x31, u8"둘"},
	{0x32, u8"둠"},
	{0x33, u8"둡"},
	{0x34, u8"둣"},
	{0x35, u8"둥"},
	{0x36, u8"둬"},
	{0x37, u8"뒀"},
	{0x38, u8"뒈"},
	{0x39, u8"뒝"},
	{0x3A, u8"뒤"},
	{0x3B, u8"뒨"},
	{0x3C, u8"뒬"},
	{0x3D, u8"뒵"},
	{0x3E, u8"뒷"},
	{0x3F, u8"뒹"},
	{0x40, u8"듀"},
	{0x41, u8"듄"},
	{0x42, u8"듈"},
	{0x43, u8"듐"},
	{0x44, u8"듕"},
	{0x45, u8"드"},
	{0x46, u8"득"},
	{0x47, u8"든"},
	{0x48, u8"듣"},
	{0x49, u8"들"},
	{0x4A, u8"듦"},
	{0x4B, u8"듬"},
	{0x4C, u8"듭"},
	{0x4D, u8"듯"},
	{0x4E, u8"등"},
	{0x4F, u8"듸"},
	{0x60, u8"디"},
	{0x61, u8"딕"},
	{0x62, u8"딘"},
	{0x63, u8"딛"},
	{0x64, u8"딜"},
	{0x65, u8"딤"},
	{0x66, u8"딥"},
	{0x67, u8"딧"},
	{0x68, u8"딨"},
	{0x69, u8"딩"},
	{0x6A, u8"딪"},
	{0x6B, u8"따"},
	{0x6C, u8"딱"},
	{0x6D, u8"딴"},
	{0x6E, u8"딸"},
	{0x71, u8"땀"},
	{0x72, u8"땁"},
	{0x73, u8"땃"},
	{0x74, u8"땄"},
	{0x75, u8"땅"},
	{0x76, u8"땋"},
	{0x77, u8"때"},
	{0x78, u8"땍"},
	{0x79, u8"땐"},
	{0x7A, u8"땔"},
	{0x7B, u8"땜"},
	{0x7C, u8"땝"},
	{0x7D, u8"땟"},
	{0x7E, u8"땠"},
	{0x7F, u8"땡"},
	{0x80, u8"떠"},
	{0x81, u8"떡"},
	{0x82, u8"떤"},
	{0x83, u8"떨"},
	{0x84, u8"떪"},
	{0x85, u8"떫"},
	{0x86, u8"떰"},
	{0x87, u8"떱"},
	{0x88, u8"떳"},
	{0x89, u8"떴"},
	{0x8A, u8"떵"},
	{0x8B, u8"떻"},
	{0x8C, u8"떼"},
	{0x8D, u8"떽"},
	{0x8E, u8"뗀"},
	{0x8F, u8"뗄"},
	{0x90, u8"뗌"},
	{0x91, u8"뗍"},
	{0x92, u8"뗏"},
	{0x93, u8"뗐"},
	{0x94, u8"뗑"},
	{0x95, u8"뗘"},
	{0x96, u8"뗬"},
	{0x97, u8"또"},
	{0x98, u8"똑"},
	{0x99, u8"똔"},
	{0x9A, u8"똘"},
	{0x9B, u8"똥"},
	{0x9C, u8"똬"},
	{0x9D, u8"똴"},
	{0x9E, u8"뙈"},
	{0x9F, u8"뙤"},
	{0xA0, u8"뙨"},
	{0xA1, u8"뚜"},
	{0xA2, u8"뚝"},
	{0xA3, u8"뚠"},
	{0xA4, u8"뚤"},
	{0xA5, u8"뚫"},
	{0xA6, u8"뚬"},
	{0xA7, u8"뚱"},
	{0xA8, u8"뛔"},
	{0xA9, u8"뛰"},
	{0xAA, u8"뛴"},
	{0xAB, u8"뛸"},
	{0xAC, u8"뜀"},
	{0xAD, u8"뜁"},
	{0xAE, u8"뜅"},
	{0xAF, u8"뜨"},
	{0xB0, u8"뜩"},
	{0xB1, u8"뜬"},
	{0xB2, u8"뜯"},
	{0xB3, u8"뜰"},
	{0xB4, u8"뜸"},
	{0xB5, u8"뜹"},
	{0xB6, u8"뜻"},
	{0xB7, u8"띄"},
	{0xB8, u8"띈"},
	{0xB9, u8"띌"},
	{0xBA, u8"띔"},
	{0xBB, u8"띕"},
	{0xBC, u8"띠"},
	{0xBD, u8"띤"},
	{0xBE, u8"띨"},
	{0xBF, u8"띰"},
	{0xC0, u8"띱"},
	{0xC1, u8"띳"},
	{0xC2, u8"띵"},
	{0xC3, u8"라"},
	{0xC4, u8"락"},
	{0xC5, u8"란"},
	{0xC6, u8"랄"},
	{0xC7, u8"람"},
	{0xC8, u8"랍"},
	{0xC9, u8"랏"},
	{0xCA, u8"랐"},
	{0xCB, u8"랑"},
	{0xCC, u8"랒"},
	{0xCD, u8"랖"},
	{0xCE, u8"랗"},
	{0xD0, u8"뢔"},
	{0xD1, u8"래"},
	{0xD2, u8"랙"},
	{0xD3, u8"랜"},
	{0xD4, u8"랠"},
	{0xD5, u8"램"},
	{0xD6, u8"랩"},
	{0xD7, u8"랫"},
	{0xD8, u8"랬"},
	{0xD9, u8"랭"},
	{0xDA, u8"랴"},
	{0xDB, u8"략"},
	{0xDC, u8"랸"},
	{0xDD, u8"럇"},
	{0xDE, u8"량"},
	{0xDF, u8"러"},
	{0xE0, u8"럭"},
	{0xE1, u8"런"},
	{0xE2, u8"럴"},
	{0xE3, u8"럼"},
	{0xE4, u8"럽"},
	{0xE5, u8"럿"},
	{0xE6, u8"렀"},
	{0xE7, u8"렁"},
	{0xE8, u8"렇"},
	{0xE9, u8"레"},
	{0xEA, u8"렉"},
	{0xEB, u8"렌"},
	{0xEC, u8"렐"},
	{0xED, u8"렘"},
	{0xEE, u8"렙"},
	{0xEF, u8"렛"},
	{0xF0, u8"렝"},
	{0xF1, u8"려"},
	{0xF2, u8"력"},
	{0xF3, u8"련"},
	{0xF4, u8"렬"},
	{0xF5, u8"렴"},
	{0xF6, u8"렵"},
	{0xF7, u8"렷"},
	{0xF8, u8"렸"},
	{0xF9, u8"령"},
	{0xFA, u8"례"},
	{0xFB, u8"롄"},
	{0xFC, u8"롑"},
	{0xFD, u8"롓"},
	{0xFE, u8"로"},
	{0xFF, u8"록"}
};

static const TextCodePair gen2TextCodesKorean4[] = {
	{0x00, u8"론"},
	{0x01, u8"롤"},
	{0x02, u8"롬"},
	{0x03, u8"롭"},
	{0x04, u8"롯"},
	{0x05, u8"롱"},
	{0x06, u8"롸"},
	{0x07, u8"롼"},
	{0x08, u8"뢍"},
	{0x09, u8"뢨"},
	{0x0A, u8"뢰"},
	{0x0B, u8"뢴"},
	{0x0C, u8"뢸"},
	{0x0D, u8"룀"},
	{0x0E, u8"룁"},
	{0x0F, u8"룃"},
	{0x10, u8"룅"},
	{0x11, u8"료"},
	{0x12, u8"룐"},
	{0x13, u8"룔"},
	{0x14, u8"룝"},
	{0x15, u8"룟"},
	{0x16, u8"룡"},
	{0x17, u8"루"},
	{0x18, u8"룩"},
	{0x19, u8"룬"},
	{0x1A, u8"룰"},
	{0x1B, u8"룸"},
	{0x1C, u8"룹"},
	{0x1D, u8"룻"},
	{0x1E, u8"룽"},
	{0x1F, u8"뤄"},
	{0x20, u8"뤘"},
	{0x21, u8"뤠"},
	{0x22, u8"뤼"},
	{0x23, u8"뤽"},
	{0x24, u8"륀"},
	{0x25, u8"륄"},
	{0x26, u8"륌"},
	{0x27, u8"륏"},
	{0x28, u8"륑"},
	{0x29, u8"류"},
	{0x2A, u8"륙"},
	{0x2B, u8"륜"},
	{0x2C, u8"률"},
	{0x2D, u8"륨"},
	{0x2E, u8"륩"},
	{0x31, u8"륫"},
	{0x32, u8"륭"},
	{0x33, u8"르"},
	{0x34, u8"륵"},
	{0x35, u8"른"},
	{0x36, u8"를"},
	{0x37, u8"름"},
	{0x38, u8"릅"},
	{0x39, u8"릇"},
	{0x3A, u8"릉"},
	{0x3B, u8"릊"},
	{0x3C, u8"릍"},
	{0x3D, u8"릎"},
	{0x3E, u8"리"},
	{0x3F, u8"릭"},
	{0x40, u8"린"},
	{0x41, u8"릴"},
	{0x42, u8"림"},
	{0x43, u8"립"},
	{0x44, u8"릿"},
	{0x45, u8"링"},
	{0x46, u8"마"},
	{0x47, u8"막"},
	{0x48, u8"만"},
	{0x49, u8"많"},
	{0x4A, u8"맏"},
	{0x4B, u8"말"},
	{0x4C, u8"맑"},
	{0x4D, u8"맒"},
	{0x4E, u8"맘"},
	{0x4F, u8"맙"},
	{0x60, u8"맛"},
	{0x61, u8"망"},
	{0x62, u8"맞"},
	{0x63, u8"맡"},
	{0x64, u8"맣"},
	{0x65, u8"매"},
	{0x66, u8"맥"},
	{0x67, u8"맨"},
	{0x68, u8"맬"},
	{0x69, u8"맴"},
	{0x6A, u8"맵"},
	{0x6B, u8"맷"},
	{0x6C, u8"맸"},
	{0x6D, u8"맹"},
	{0x6E, u8"맺"},
	{0x6F, u8"먀"},
	{0x70, u8"먁"},
	{0x71, u8"먈"},
	{0x72, u8"먕"},
	{0x73, u8"머"},
	{0x74, u8"먹"},
	{0x75, u8"먼"},
	{0x76, u8"멀"},
	{0x77, u8"멂"},
	{0x78, u8"멈"},
	{0x79, u8"멉"},
	{0x7A, u8"멋"},
	{0x7B, u8"멍"},
	{0x7C, u8"멎"},
	{0x7D, u8"멓"},
	{0x7E, u8"메"},
	{0x7F, u8"멕"},
	{0x80, u8"멘"},
	{0x81, u8"멜"},
	{0x82, u8"멤"},
	{0x83, u8"멥"},
	{0x84, u8"멧"},
	{0x85, u8"멨"},
	{0x86, u8"멩"},
	{0x87, u8"며"},
	{0x88, u8"멱"},
	{0x89, u8"면"},
	{0x8A, u8"멸"},
	{0x8B, u8"몃"},
	{0x8C, u8"몄"},
	{0x8D, u8"명"},
	{0x8E, u8"몇"},
	{0x8F, u8"몌"},
	{0x90, u8"모"},
	{0x91, u8"목"},
	{0x92, u8"몫"},
	{0x93, u8"몬"},
	{0x94, u8"몰"},
	{0x95, u8"몲"},
	{0x96, u8"몸"},
	{0x97, u8"몹"},
	{0x98, u8"못"},
	{0x99, u8"몽"},
	{0x9A, u8"뫄"},
	{0x9B, u8"뫈"},
	{0x9C, u8"뫘"},
	{0x9D, u8"뫙"},
	{0x9E, u8"뫼"},
	{0xA1, u8"묀"},
	{0xA2, u8"묄"},
	{0xA3, u8"묍"},
	{0xA4, u8"묏"},
	{0xA5, u8"묑"},
	{0xA6, u8"묘"},
	{0xA7, u8"묜"},
	{0xA8, u8"묠"},
	{0xA9, u8"묩"},
	{0xAA, u8"묫"},
	{0xAB, u8"무"},
	{0xAC, u8"묵"},
	{0xAD, u8"묶"},
	{0xAE, u8"문"},
	{0xAF, u8"묻"},
	{0xB0, u8"물"},
	{0xB1, u8"묽"},
	{0xB2, u8"묾"},
	{0xB3, u8"뭄"},
	{0xB4, u8"뭅"},
	{0xB5, u8"뭇"},
	{0xB6, u8"뭉"},
	{0xB7, u8"뭍"},
	{0xB8, u8"뭏"},
	{0xB9, u8"뭐"},
	{0xBA, u8"뭔"},
	{0xBB, u8"뭘"},
	{0xBC, u8"뭡"},
	{0xBD, u8"뭣"},
	{0xBE, u8"뭬"},
	{0xBF, u8"뮈"},
	{0xC0, u8"뮌"},
	{0xC1, u8"뮐"},
	{0xC2, u8"뮤"},
	{0xC3, u8"뮨"},
	{0xC4, u8"뮬"},
	{0xC5, u8"뮴"},
	{0xC6, u8"뮷"},
	{0xC7, u8"므"},
	{0xC8, u8"믄"},
	{0xC9, u8"믈"},
	{0xCA, u8"믐"},
	{0xCB, u8"믓"},
	{0xCC, u8"미"},
	{0xCD, u8"믹"},
	{0xCE, u8"민"},
	{0xCF, u8"믿"},
	{0xD0, u8"밀"},
	{0xD1, u8"밂"},
	{0xD2, u8"밈"},
	{0xD3, u8"밉"},
	{0xD4, u8"밋"},
	{0xD5, u8"밌"},
	{0xD6, u8"밍"},
	{0xD7, u8"및"},
	{0xD8, u8"밑"},
	{0xD9, u8"바"},
	{0xDA, u8"박"},
	{0xDB, u8"밖"},
	{0xDC, u8"밗"},
	{0xDD, u8"반"},
	{0xDE, u8"받"},
	{0xDF, u8"발"},
	{0xE0, u8"밝"},
	{0xE1, u8"밞"},
	{0xE2, u8"밟"},
	{0xE3, u8"밤"},
	{0xE4, u8"밥"},
	{0xE5, u8"밧"},
	{0xE6, u8"방"},
	{0xE7, u8"밭"},
	{0xE8, u8"배"},
	{0xE9, u8"백"},
	{0xEA, u8"밴"},
	{0xEB, u8"밸"},
	{0xEC, u8"뱀"},
	{0xED, u8"뱁"},
	{0xEE, u8"뱃"},
	{0xEF, u8"뱄"},
	{0xF0, u8"뱅"},
	{0xF1, u8"뱉"},
	{0xF2, u8"뱌"},
	{0xF3, u8"뱍"},
	{0xF4, u8"뱐"},
	{0xF5, u8"뱝"},
	{0xF6, u8"버"},
	{0xF7, u8"벅"},
	{0xF8, u8"번"},
	{0xF9, u8"벋"},
	{0xFA, u8"벌"},
	{0xFB, u8"벎"},
	{0xFC, u8"범"},
	{0xFD, u8"법"},
	{0xFE, u8"벗"}
};

static const TextCodePair gen2TextCodesKorean5[] = {
	{0x01, u8"벙"},
	{0x02, u8"벚"},
	{0x03, u8"베"},
	{0x04, u8"벡"},
	{0x05, u8"벤"},
	{0x06, u8"벧"},
	{0x07, u8"벨"},
	{0x08, u8"벰"},
	{0x09, u8"벱"},
	{0x0A, u8"벳"},
	{0x0B, u8"벴"},
	{0x0C, u8"벵"},
	{0x0D, u8"벼"},
	{0x0E, u8"벽"},
	{0x0F, u8"변"},
	{0x10, u8"별"},
	{0x11, u8"볍"},
	{0x12, u8"볏"},
	{0x13, u8"볐"},
	{0x14, u8"병"},
	{0x15, u8"볕"},
	{0x16, u8"볘"},
	{0x17, u8"볜"},
	{0x18, u8"보"},
	{0x19, u8"복"},
	{0x1A, u8"볶"},
	{0x1B, u8"본"},
	{0x1C, u8"볼"},
	{0x1D, u8"봄"},
	{0x1E, u8"봅"},
	{0x1F, u8"봇"},
	{0x20, u8"봉"},
	{0x21, u8"봐"},
	{0x22, u8"봔"},
	{0x23, u8"봤"},
	{0x24, u8"봬"},
	{0x25, u8"뵀"},
	{0x26, u8"뵈"},
	{0x27, u8"뵉"},
	{0x28, u8"뵌"},
	{0x29, u8"뵐"},
	{0x2A, u8"뵘"},
	{0x2B, u8"뵙"},
	{0x2C, u8"뵤"},
	{0x2D, u8"뵨"},
	{0x2E, u8"부"},
	{0x2F, u8"북"},
	{0x30, u8"분"},
	{0x31, u8"붇"},
	{0x32, u8"불"},
	{0x33, u8"붉"},
	{0x34, u8"붊"},
	{0x35, u8"붐"},
	{0x36, u8"붑"},
	{0x37, u8"붓"},
	{0x38, u8"붕"},
	{0x39, u8"붙"},
	{0x3A, u8"붚"},
	{0x3B, u8"붜"},
	{0x3C, u8"붤"},
	{0x3D, u8"붰"},
	{0x3E, u8"붸"},
	{0x3F, u8"뷔"},
	{0x40, u8"뷕"},
	{0x41, u8"뷘"},
	{0x42, u8"뷜"},
	{0x43, u8"뷩"},
	{0x44, u8"뷰"},
	{0x45, u8"뷴"},
	{0x46, u8"뷸"},
	{0x47, u8"븀"},
	{0x48, u8"븃"},
	{0x49, u8"븅"},
	{0x4A, u8"브"},
	{0x4B, u8"븍"},
	{0x4C, u8"븐"},
	{0x4D, u8"블"},
	{0x4E, u8"븜"},
	{0x4F, u8"븝"},
	{0x60, u8"븟"},
	{0x61, u8"비"},
	{0x62, u8"빅"},
	{0x63, u8"빈"},
	{0x64, u8"빌"},
	{0x65, u8"빎"},
	{0x66, u8"빔"},
	{0x67, u8"빕"},
	{0x68, u8"빗"},
	{0x69, u8"빙"},
	{0x6A, u8"빚"},
	{0x6B, u8"빛"},
	{0x6C, u8"빠"},
	{0x6D, u8"빡"},
	{0x6E, u8"빤"},
	{0x71, u8"빨"},
	{0x72, u8"빪"},
	{0x73, u8"빰"},
	{0x74, u8"빱"},
	{0x75, u8"빳"},
	{0x76, u8"빴"},
	{0x77, u8"빵"},
	{0x78, u8"빻"},
	{0x79, u8"빼"},
	{0x7A, u8"빽"},
	{0x7B, u8"뺀"},
	{0x7C, u8"뺄"},
	{0x7D, u8"뺌"},
	{0x7E, u8"뺍"},
	{0x7F, u8"뺏"},
	{0x80, u8"뺐"},
	{0x81, u8"뺑"},
	{0x82, u8"뺘"},
	{0x83, u8"뺙"},
	{0x84, u8"뺨"},
	{0x85, u8"뻐"},
	{0x86, u8"뻑"},
	{0x87, u8"뻔"},
	{0x88, u8"뻗"},
	{0x89, u8"뻘"},
	{0x8A, u8"뻠"},
	{0x8B, u8"뻣"},
	{0x8C, u8"뻤"},
	{0x8D, u8"뻥"},
	{0x8E, u8"뻬"},
	{0x8F, u8"뼁"},
	{0x90, u8"뼈"},
	{0x91, u8"뼉"},
	{0x92, u8"뼘"},
	{0x93, u8"뼙"},
	{0x94, u8"뼛"},
	{0x95, u8"뼜"},
	{0x96, u8"뼝"},
	{0x97, u8"뽀"},
	{0x98, u8"뽁"},
	{0x99, u8"뽄"},
	{0x9A, u8"뽈"},
	{0x9B, u8"뽐"},
	{0x9C, u8"뽑"},
	{0x9D, u8"뽕"},
	{0x9E, u8"뾔"},
	{0x9F, u8"뾰"},
	{0xA0, u8"뿅"},
	{0xA1, u8"뿌"},
	{0xA2, u8"뿍"},
	{0xA3, u8"뿐"},
	{0xA4, u8"뿔"},
	{0xA5, u8"뿜"},
	{0xA6, u8"뿟"},
	{0xA7, u8"뿡"},
	{0xA8, u8"쀼"},
	{0xA9, u8"쁑"},
	{0xAA, u8"쁘"},
	{0xAB, u8"쁜"},
	{0xAC, u8"쁠"},
	{0xAD, u8"쁨"},
	{0xAE, u8"쁩"},
	{0xAF, u8"삐"},
	{0xB0, u8"삑"},
	{0xB1, u8"삔"},
	{0xB2, u8"삘"},
	{0xB3, u8"삠"},
	{0xB4, u8"삡"},
	{0xB5, u8"삣"},
	{0xB6, u8"삥"},
	{0xB7, u8"사"},
	{0xB8, u8"삭"},
	{0xB9, u8"삯"},
	{0xBA, u8"산"},
	{0xBB, u8"삳"},
	{0xBC, u8"살"},
	{0xBD, u8"삵"},
	{0xBE, u8"삶"},
	{0xBF, u8"삼"},
	{0xC0, u8"삽"},
	{0xC1, u8"삿"},
	{0xC2, u8"샀"},
	{0xC3, u8"상"},
	{0xC4, u8"샅"},
	{0xC5, u8"새"},
	{0xC6, u8"색"},
	{0xC7, u8"샌"},
	{0xC8, u8"샐"},
	{0xC9, u8"샘"},
	{0xCA, u8"샙"},
	{0xCB, u8"샛"},
	{0xCC, u8"샜"},
	{0xCD, u8"생"},
	{0xCE, u8"샤"},
	{0xD1, u8"샥"},
	{0xD2, u8"샨"},
	{0xD3, u8"샬"},
	{0xD4, u8"샴"},
	{0xD5, u8"샵"},
	{0xD6, u8"샷"},
	{0xD7, u8"샹"},
	{0xD8, u8"섀"},
	{0xD9, u8"섄"},
	{0xDA, u8"섈"},
	{0xDB, u8"섐"},
	{0xDC, u8"섕"},
	{0xDD, u8"서"},
	{0xDE, u8"석"},
	{0xDF, u8"섞"},
	{0xE0, u8"섟"},
	{0xE1, u8"선"},
	{0xE2, u8"섣"},
	{0xE3, u8"설"},
	{0xE4, u8"섦"},
	{0xE5, u8"섧"},
	{0xE6, u8"섬"},
	{0xE7, u8"섭"},
	{0xE8, u8"섯"},
	{0xE9, u8"섰"},
	{0xEA, u8"성"},
	{0xEB, u8"섶"},
	{0xEC, u8"세"},
	{0xED, u8"섹"},
	{0xEE, u8"센"},
	{0xEF, u8"셀"},
	{0xF0, u8"셈"},
	{0xF1, u8"셉"},
	{0xF2, u8"셋"},
	{0xF3, u8"셌"},
	{0xF4, u8"셍"},
	{0xF5, u8"셔"},
	{0xF6, u8"셕"},
	{0xF7, u8"션"},
	{0xF8, u8"셜"},
	{0xF9, u8"셤"},
	{0xFA, u8"셥"},
	{0xFB, u8"셧"},
	{0xFC, u8"셨"},
	{0xFD, u8"셩"},
	{0xFE, u8"셰"},
	{0xFF, u8"셴"}
};

static const TextCodePair gen2TextCodesKorean6[] = {
	{0x00, u8"셸"},
	{0x01, u8"솅"},
	{0x02, u8"소"},
	{0x03, u8"속"},
	{0x04, u8"솎"},
	{0x05, u8"손"},
	{0x06, u8"솔"},
	{0x07, u8"솖"},
	{0x08, u8"솜"},
	{0x09, u8"솝"},
	{0x0A, u8"솟"},
	{0x0B, u8"송"},
	{0x0C, u8"솥"},
	{0x0D, u8"솨"},
	{0x0E, u8"솩"},
	{0x0F, u8"솬"},
	{0x10, u8"솰"},
	{0x11, u8"솽"},
	{0x12, u8"쇄"},
	{0x13, u8"쇈"},
	{0x14, u8"쇌"},
	{0x15, u8"쇔"},
	{0x16, u8"쇗"},
	{0x17, u8"쇘"},
	{0x18, u8"쇠"},
	{0x19, u8"쇤"},
	{0x1A, u8"쇨"},
	{0x1B, u8"쇰"},
	{0x1C, u8"쇱"},
	{0x1D, u8"쇳"},
	{0x1E, u8"쇼"},
	{0x1F, u8"쇽"},
	{0x20, u8"숀"},
	{0x21, u8"숄"},
	{0x22, u8"숌"},
	{0x23, u8"숍"},
	{0x24, u8"숏"},
	{0x25, u8"숑"},
	{0x26, u8"수"},
	{0x27, u8"숙"},
	{0x28, u8"순"},
	{0x29, u8"숟"},
	{0x2A, u8"술"},
	{0x2B, u8"숨"},
	{0x2C, u8"숩"},
	{0x2D, u8"숫"},
	{0x2E, u8"숭"},
	{0x2F, u8"쌰"},
	{0x30, u8"쎼"},
	{0x31, u8"숯"},
	{0x32, u8"숱"},
	{0x33, u8"숲"},
	{0x34, u8"숴"},
	{0x35, u8"쉈"},
	{0x36, u8"쉐"},
	{0x37, u8"쉑"},
	{0x38, u8"쉔"},
	{0x39, u8"쉘"},
	{0x3A, u8"쉠"},
	{0x3B, u8"쉥"},
	{0x3C, u8"쉬"},
	{0x3D, u8"쉭"},
	{0x3E, u8"쉰"},
	{0x3F, u8"쉴"},
	{0x40, u8"쉼"},
	{0x41, u8"쉽"},
	{0x42, u8"쉿"},
	{0x43, u8"슁"},
	{0x44, u8"슈"},
	{0x45, u8"슉"},
	{0x46, u8"슐"},
	{0x47, u8"슘"},
	{0x48, u8"슛"},
	{0x49, u8"슝"},
	{0x4A, u8"스"},
	{0x4B, u8"슥"},
	{0x4C, u8"슨"},
	{0x4D, u8"슬"},
	{0x4E, u8"슭"},
	{0x4F, u8"슴"},
	{0x60, u8"습"},
	{0x61, u8"슷"},
	{0x62, u8"승"},
	{0x63, u8"시"},
	{0x64, u8"식"},
	{0x65, u8"신"},
	{0x66, u8"싣"},
	{0x67, u8"실"},
	{0x68, u8"싫"},
	{0x69, u8"심"},
	{0x6A, u8"십"},
	{0x6B, u8"싯"},
	{0x6C, u8"싱"},
	{0x6D, u8"싶"},
	{0x6E, u8"싸"},
	{0x6F, u8"싹"},
	{0x70, u8"싻"},
	{0x71, u8"싼"},
	{0x72, u8"쌀"},
	{0x73, u8"쌈"},
	{0x74, u8"쌉"},
	{0x75, u8"쌌"},
	{0x76, u8"쌍"},
	{0x77, u8"쌓"},
	{0x78, u8"쌔"},
	{0x79, u8"쌕"},
	{0x7A, u8"쌘"},
	{0x7B, u8"쌜"},
	{0x7C, u8"쌤"},
	{0x7D, u8"쌥"},
	{0x7E, u8"쌨"},
	{0x7F, u8"쌩"},
	{0x80, u8"썅"},
	{0x81, u8"써"},
	{0x82, u8"썩"},
	{0x83, u8"썬"},
	{0x84, u8"썰"},
	{0x85, u8"썲"},
	{0x86, u8"썸"},
	{0x87, u8"썹"},
	{0x88, u8"썼"},
	{0x89, u8"썽"},
	{0x8A, u8"쎄"},
	{0x8B, u8"쎈"},
	{0x8C, u8"쎌"},
	{0x8D, u8"쏀"},
	{0x8E, u8"쏘"},
	{0x8F, u8"쏙"},
	{0x90, u8"쏜"},
	{0x91, u8"쏟"},
	{0x92, u8"쏠"},
	{0x93, u8"쏢"},
	{0x94, u8"쏨"},
	{0x95, u8"쏩"},
	{0x96, u8"쏭"},
	{0x97, u8"쏴"},
	{0x98, u8"쏵"},
	{0x99, u8"쏸"},
	{0x9A, u8"쐈"},
	{0x9B, u8"쐐"},
	{0x9C, u8"쐤"},
	{0x9D, u8"쐬"},
	{0x9E, u8"쐰"},
	{0xA0, u8"쓔"},
	{0xA1, u8"쐴"},
	{0xA2, u8"쐼"},
	{0xA3, u8"쐽"},
	{0xA4, u8"쑈"},
	{0xA5, u8"쑤"},
	{0xA6, u8"쑥"},
	{0xA7, u8"쑨"},
	{0xA8, u8"쑬"},
	{0xA9, u8"쑴"},
	{0xAA, u8"쑵"},
	{0xAB, u8"쑹"},
	{0xAC, u8"쒀"},
	{0xAD, u8"쒔"},
	{0xAE, u8"쒜"},
	{0xAF, u8"쒸"},
	{0xB0, u8"쒼"},
	{0xB1, u8"쓩"},
	{0xB2, u8"쓰"},
	{0xB3, u8"쓱"},
	{0xB4, u8"쓴"},
	{0xB5, u8"쓸"},
	{0xB6, u8"쓺"},
	{0xB7, u8"쓿"},
	{0xB8, u8"씀"},
	{0xB9, u8"씁"},
	{0xBA, u8"씌"},
	{0xBB, u8"씐"},
	{0xBC, u8"씔"},
	{0xBD, u8"씜"},
	{0xBE, u8"씨"},
	{0xBF, u8"씩"},
	{0xC0, u8"씬"},
	{0xC1, u8"씰"},
	{0xC2, u8"씸"},
	{0xC3, u8"씹"},
	{0xC4, u8"씻"},
	{0xC5, u8"씽"},
	{0xC6, u8"아"},
	{0xC7, u8"악"},
	{0xC8, u8"안"},
	{0xC9, u8"앉"},
	{0xCA, u8"않"},
	{0xCB, u8"알"},
	{0xCC, u8"앍"},
	{0xCD, u8"앎"},
	{0xCE, u8"앓"},
	{0xCF, u8"암"},
	{0xD0, u8"압"},
	{0xD1, u8"앗"},
	{0xD2, u8"았"},
	{0xD3, u8"앙"},
	{0xD4, u8"앝"},
	{0xD5, u8"앞"},
	{0xD6, u8"애"},
	{0xD7, u8"액"},
	{0xD8, u8"앤"},
	{0xD9, u8"앨"},
	{0xDA, u8"앰"},
	{0xDB, u8"앱"},
	{0xDC, u8"앳"},
	{0xDD, u8"앴"},
	{0xDE, u8"앵"},
	{0xDF, u8"야"},
	{0xE0, u8"약"},
	{0xE1, u8"얀"},
	{0xE2, u8"얄"},
	{0xE3, u8"얇"},
	{0xE4, u8"얌"},
	{0xE5, u8"얍"},
	{0xE6, u8"얏"},
	{0xE7, u8"양"},
	{0xE8, u8"얕"},
	{0xE9, u8"얗"},
	{0xEA, u8"얘"},
	{0xEB, u8"얜"},
	{0xEC, u8"얠"},
	{0xED, u8"얩"},
	{0xEE, u8"어"},
	{0xEF, u8"억"},
	{0xF0, u8"언"},
	{0xF1, u8"얹"},
	{0xF2, u8"얻"},
	{0xF3, u8"얼"},
	{0xF4, u8"얽"},
	{0xF5, u8"얾"},
	{0xF6, u8"엄"},
	{0xF7, u8"업"},
	{0xF8, u8"없"},
	{0xF9, u8"엇"},
	{0xFA, u8"었"},
	{0xFB, u8"엉"},
	{0xFC, u8"엊"},
	{0xFD, u8"엌"},
	{0xFE, u8"엎"}
};

static const TextCodePair gen2TextCodesKorean7[] = {
	{0x01, u8"에"},
	{0x02, u8"엑"},
	{0x03, u8"엔"},
	{0x04, u8"엘"},
	{0x05, u8"엠"},
	{0x06, u8"엡"},
	{0x07, u8"엣"},
	{0x08, u8"엥"},
	{0x09, u8"여"},
	{0x0A, u8"역"},
	{0x0B, u8"엮"},
	{0x0C, u8"연"},
	{0x0D, u8"열"},
	{0x0E, u8"엶"},
	{0x0F, u8"엷"},
	{0x10, u8"염"},
	{0x11, u8"엽"},
	{0x12, u8"엾"},
	{0x13, u8"엿"},
	{0x14, u8"였"},
	{0x15, u8"영"},
	{0x16, u8"옅"},
	{0x17, u8"옆"},
	{0x18, u8"옇"},
	{0x19, u8"예"},
	{0x1A, u8"옌"},
	{0x1B, u8"옐"},
	{0x1C, u8"옘"},
	{0x1D, u8"옙"},
	{0x1E, u8"옛"},
	{0x1F, u8"옜"},
	{0x20, u8"오"},
	{0x21, u8"옥"},
	{0x22, u8"온"},
	{0x23, u8"올"},
	{0x24, u8"옭"},
	{0x25, u8"옮"},
	{0x26, u8"옰"},
	{0x27, u8"옳"},
	{0x28, u8"옴"},
	{0x29, u8"옵"},
	{0x2A, u8"옷"},
	{0x2B, u8"옹"},
	{0x2C, u8"옻"},
	{0x2D, u8"와"},
	{0x2E, u8"왁"},
	{0x2F, u8"완"},
	{0x30, u8"왈"},
	{0x31, u8"왐"},
	{0x32, u8"왑"},
	{0x33, u8"왓"},
	{0x34, u8"왔"},
	{0x35, u8"왕"},
	{0x36, u8"왜"},
	{0x37, u8"왝"},
	{0x38, u8"왠"},
	{0x39, u8"왬"},
	{0x3A, u8"왯"},
	{0x3B, u8"왱"},
	{0x3C, u8"외"},
	{0x3D, u8"왹"},
	{0x3E, u8"왼"},
	{0x3F, u8"욀"},
	{0x40, u8"욈"},
	{0x41, u8"욉"},
	{0x42, u8"욋"},
	{0x43, u8"욍"},
	{0x44, u8"요"},
	{0x45, u8"욕"},
	{0x46, u8"욘"},
	{0x47, u8"욜"},
	{0x48, u8"욤"},
	{0x49, u8"욥"},
	{0x4A, u8"욧"},
	{0x4B, u8"용"},
	{0x4C, u8"우"},
	{0x4D, u8"욱"},
	{0x4E, u8"운"},
	{0x4F, u8"울"},
	{0x60, u8"욹"},
	{0x61, u8"욺"},
	{0x62, u8"움"},
	{0x63, u8"웁"},
	{0x64, u8"웃"},
	{0x65, u8"웅"},
	{0x66, u8"워"},
	{0x67, u8"웍"},
	{0x68, u8"원"},
	{0x69, u8"월"},
	{0x6A, u8"웜"},
	{0x6B, u8"웝"},
	{0x6C, u8"웠"},
	{0x6D, u8"웡"},
	{0x6E, u8"웨"},
	{0x71, u8"웩"},
	{0x72, u8"웬"},
	{0x73, u8"웰"},
	{0x74, u8"웸"},
	{0x75, u8"웹"},
	{0x76, u8"웽"},
	{0x77, u8"위"},
	{0x78, u8"윅"},
	{0x79, u8"윈"},
	{0x7A, u8"윌"},
	{0x7B, u8"윔"},
	{0x7C, u8"윕"},
	{0x7D, u8"윗"},
	{0x7E, u8"윙"},
	{0x7F, u8"유"},
	{0x80, u8"육"},
	{0x81, u8"윤"},
	{0x82, u8"율"},
	{0x83, u8"윰"},
	{0x84, u8"윱"},
	{0x85, u8"윳"},
	{0x86, u8"융"},
	{0x87, u8"윷"},
	{0x88, u8"으"},
	{0x89, u8"윽"},
	{0x8A, u8"은"},
	{0x8B, u8"을"},
	{0x8C, u8"읆"},
	{0x8D, u8"음"},
	{0x8E, u8"읍"},
	{0x8F, u8"읏"},
	{0x90, u8"응"},
	{0x91, u8"읒"},
	{0x92, u8"읓"},
	{0x93, u8"읔"},
	{0x94, u8"읕"},
	{0x95, u8"읖"},
	{0x96, u8"읗"},
	{0x97, u8"의"},
	{0x98, u8"읜"},
	{0x99, u8"읠"},
	{0x9A, u8"읨"},
	{0x9B, u8"읫"},
	{0x9C, u8"이"},
	{0x9D, u8"익"},
	{0x9E, u8"인"},
	{0x9F, u8"일"},
	{0xA0, u8"읽"},
	{0xA1, u8"읾"},
	{0xA2, u8"잃"},
	{0xA3, u8"임"},
	{0xA4, u8"입"},
	{0xA5, u8"잇"},
	{0xA6, u8"있"},
	{0xA7, u8"잉"},
	{0xA8, u8"잊"},
	{0xA9, u8"잎"},
	{0xAA, u8"자"},
	{0xAB, u8"작"},
	{0xAC, u8"잔"},
	{0xAD, u8"잖"},
	{0xAE, u8"잗"},
	{0xAF, u8"잘"},
	{0xB0, u8"잚"},
	{0xB1, u8"잠"},
	{0xB2, u8"잡"},
	{0xB3, u8"잣"},
	{0xB4, u8"잤"},
	{0xB5, u8"장"},
	{0xB6, u8"잦"},
	{0xB7, u8"재"},
	{0xB8, u8"잭"},
	{0xB9, u8"잰"},
	{0xBA, u8"잴"},
	{0xBB, u8"잼"},
	{0xBC, u8"잽"},
	{0xBD, u8"잿"},
	{0xBE, u8"쟀"},
	{0xBF, u8"쟁"},
	{0xC0, u8"쟈"},
	{0xC1, u8"쟉"},
	{0xC2, u8"쟌"},
	{0xC3, u8"쟎"},
	{0xC4, u8"쟐"},
	{0xC5, u8"쟘"},
	{0xC6, u8"쟝"},
	{0xC7, u8"쟤"},
	{0xC8, u8"쟨"},
	{0xC9, u8"쟬"},
	{0xCA, u8"저"},
	{0xCB, u8"적"},
	{0xCC, u8"전"},
	{0xCD, u8"절"},
	{0xCE, u8"젊"},
	{0xD1, u8"점"},
	{0xD2, u8"접"},
	{0xD3, u8"젓"},
	{0xD4, u8"정"},
	{0xD5, u8"젖"},
	{0xD6, u8"제"},
	{0xD7, u8"젝"},
	{0xD8, u8"젠"},
	{0xD9, u8"젤"},
	{0xDA, u8"젬"},
	{0xDB, u8"젭"},
	{0xDC, u8"젯"},
	{0xDD, u8"젱"},
	{0xDE, u8"져"},
	{0xDF, u8"젼"},
	{0xE0, u8"졀"},
	{0xE1, u8"졈"},
	{0xE2, u8"졉"},
	{0xE3, u8"졌"},
	{0xE4, u8"졍"},
	{0xE5, u8"졔"},
	{0xE6, u8"조"},
	{0xE7, u8"족"},
	{0xE8, u8"존"},
	{0xE9, u8"졸"},
	{0xEA, u8"졺"},
	{0xEB, u8"좀"},
	{0xEC, u8"좁"},
	{0xED, u8"좃"},
	{0xEE, u8"종"},
	{0xEF, u8"좆"},
	{0xF0, u8"좇"},
	{0xF1, u8"좋"},
	{0xF2, u8"좌"},
	{0xF3, u8"좍"},
	{0xF4, u8"좔"},
	{0xF5, u8"좝"},
	{0xF6, u8"좟"},
	{0xF7, u8"좡"},
	{0xF8, u8"좨"},
	{0xF9, u8"좼"},
	{0xFA, u8"좽"},
	{0xFB, u8"죄"},
	{0xFC, u8"죈"},
	{0xFD, u8"죌"},
	{0xFE, u8"죔"},
	{0xFF, u8"죕"}
};

static const TextCodePair gen2TextCodesKorean8[] = {
	{0x00, u8"죗"},
	{0x01, u8"죙"},
	{0x02, u8"죠"},
	{0x03, u8"죡"},
	{0x04, u8"죤"},
	{0x05, u8"죵"},
	{0x06, u8"주"},
	{0x07, u8"죽"},
	{0x08, u8"준"},
	{0x09, u8"줄"},
	{0x0A, u8"줅"},
	{0x0B, u8"줆"},
	{0x0C, u8"줌"},
	{0x0D, u8"줍"},
	{0x0E, u8"줏"},
	{0x0F, u8"중"},
	{0x10, u8"줘"},
	{0x11, u8"줬"},
	{0x12, u8"줴"},
	{0x13, u8"쥐"},
	{0x14, u8"쥑"},
	{0x15, u8"쥔"},
	{0x16, u8"쥘"},
	{0x17, u8"쥠"},
	{0x18, u8"쥡"},
	{0x19, u8"쥣"},
	{0x1A, u8"쥬"},
	{0x1B, u8"쥰"},
	{0x1C, u8"쥴"},
	{0x1D, u8"쥼"},
	{0x1E, u8"즈"},
	{0x1F, u8"즉"},
	{0x20, u8"즌"},
	{0x21, u8"즐"},
	{0x22, u8"즘"},
	{0x23, u8"즙"},
	{0x24, u8"즛"},
	{0x25, u8"증"},
	{0x26, u8"지"},
	{0x27, u8"직"},
	{0x28, u8"진"},
	{0x29, u8"짇"},
	{0x2A, u8"질"},
	{0x2B, u8"짊"},
	{0x2C, u8"짐"},
	{0x2D, u8"집"},
	{0x2E, u8"짓"},
	{0x30, u8"쬬"},
	{0x31, u8"징"},
	{0x32, u8"짖"},
	{0x33, u8"짙"},
	{0x34, u8"짚"},
	{0x35, u8"짜"},
	{0x36, u8"짝"},
	{0x37, u8"짠"},
	{0x38, u8"짢"},
	{0x39, u8"짤"},
	{0x3A, u8"짧"},
	{0x3B, u8"짬"},
	{0x3C, u8"짭"},
	{0x3D, u8"짯"},
	{0x3E, u8"짰"},
	{0x3F, u8"짱"},
	{0x40, u8"째"},
	{0x41, u8"짹"},
	{0x42, u8"짼"},
	{0x43, u8"쨀"},
	{0x44, u8"쨈"},
	{0x45, u8"쨉"},
	{0x46, u8"쨋"},
	{0x47, u8"쨌"},
	{0x48, u8"쨍"},
	{0x49, u8"쨔"},
	{0x4A, u8"쨘"},
	{0x4B, u8"쨩"},
	{0x4C, u8"쩌"},
	{0x4D, u8"쩍"},
	{0x4E, u8"쩐"},
	{0x4F, u8"쩔"},
	{0x60, u8"쩜"},
	{0x61, u8"쩝"},
	{0x62, u8"쩟"},
	{0x63, u8"쩠"},
	{0x64, u8"쩡"},
	{0x65, u8"쩨"},
	{0x66, u8"쩽"},
	{0x67, u8"쪄"},
	{0x68, u8"쪘"},
	{0x69, u8"쪼"},
	{0x6A, u8"쪽"},
	{0x6B, u8"쫀"},
	{0x6C, u8"쫄"},
	{0x6D, u8"쫌"},
	{0x6E, u8"쫍"},
	{0x6F, u8"쫏"},
	{0x70, u8"쫑"},
	{0x71, u8"쫓"},
	{0x72, u8"쫘"},
	{0x73, u8"쫙"},
	{0x74, u8"쫠"},
	{0x75, u8"쫬"},
	{0x76, u8"쫴"},
	{0x77, u8"쫴"},
	{0x78, u8"쬐"},
	{0x79, u8"쬔"},
	{0x7A, u8"쬘"},
	{0x7B, u8"쬠"},
	{0x7C, u8"쬡"},
	{0x7D, u8"쭁"},
	{0x7E, u8"쭈"},
	{0x7F, u8"쭉"},
	{0x80, u8"쭌"},
	{0x81, u8"쭐"},
	{0x82, u8"쭘"},
	{0x83, u8"쭙"},
	{0x84, u8"쭝"},
	{0x85, u8"쭤"},
	{0x86, u8"쭸"},
	{0x87, u8"쭹"},
	{0x88, u8"쮜"},
	{0x89, u8"쮸"},
	{0x8A, u8"쯔"},
	{0x8B, u8"쯤"},
	{0x8C, u8"쯧"},
	{0x8D, u8"쯩"},
	{0x8E, u8"찌"},
	{0x8F, u8"찍"},
	{0x90, u8"찐"},
	{0x91, u8"찔"},
	{0x92, u8"찜"},
	{0x93, u8"찝"},
	{0x94, u8"찡"},
	{0x95, u8"찢"},
	{0x96, u8"찧"},
	{0x97, u8"차"},
	{0x98, u8"착"},
	{0x99, u8"찬"},
	{0x9A, u8"찮"},
	{0x9B, u8"찰"},
	{0x9C, u8"참"},
	{0x9D, u8"찹"},
	{0x9E, u8"찻"},
	{0xA1, u8"찼"},
	{0xA2, u8"창"},
	{0xA3, u8"찾"},
	{0xA4, u8"채"},
	{0xA5, u8"책"},
	{0xA6, u8"챈"},
	{0xA7, u8"챌"},
	{0xA8, u8"챔"},
	{0xA9, u8"챕"},
	{0xAA, u8"챗"},
	{0xAB, u8"챘"},
	{0xAC, u8"챙"},
	{0xAD, u8"챠"},
	{0xAE, u8"챤"},
	{0xAF, u8"챦"},
	{0xB0, u8"챨"},
	{0xB1, u8"챰"},
	{0xB2, u8"챵"},
	{0xB3, u8"처"},
	{0xB4, u8"척"},
	{0xB5, u8"천"},
	{0xB6, u8"철"},
	{0xB7, u8"첨"},
	{0xB8, u8"첩"},
	{0xB9, u8"첫"},
	{0xBA, u8"첬"},
	{0xBB, u8"청"},
	{0xBC, u8"체"},
	{0xBD, u8"첵"},
	{0xBE, u8"첸"},
	{0xBF, u8"첼"},
	{0xC0, u8"쳄"},
	{0xC1, u8"쳅"},
	{0xC2, u8"쳇"},
	{0xC3, u8"쳉"},
	{0xC4, u8"쳐"},
	{0xC5, u8"쳔"},
	{0xC6, u8"쳤"},
	{0xC7, u8"쳬"},
	{0xC8, u8"쳰"},
	{0xC9, u8"촁"},
	{0xCA, u8"초"},
	{0xCB, u8"촉"},
	{0xCC, u8"촌"},
	{0xCD, u8"촐"},
	{0xCE, u8"촘"},
	{0xCF, u8"촙"},
	{0xD0, u8"촛"},
	{0xD1, u8"총"},
	{0xD2, u8"촤"},
	{0xD3, u8"촨"},
	{0xD4, u8"촬"},
	{0xD5, u8"촹"},
	{0xD6, u8"최"},
	{0xD7, u8"쵠"},
	{0xD8, u8"쵤"},
	{0xD9, u8"쵬"},
	{0xDA, u8"쵭"},
	{0xDB, u8"쵯"},
	{0xDC, u8"쵱"},
	{0xDD, u8"쵸"},
	{0xDE, u8"춈"},
	{0xDF, u8"추"},
	{0xE0, u8"축"},
	{0xE1, u8"춘"},
	{0xE2, u8"출"},
	{0xE3, u8"춤"},
	{0xE4, u8"춥"},
	{0xE5, u8"춧"},
	{0xE6, u8"충"},
	{0xE7, u8"춰"},
	{0xE8, u8"췄"},
	{0xE9, u8"췌"},
	{0xEA, u8"췐"},
	{0xEB, u8"취"},
	{0xEC, u8"췬"},
	{0xED, u8"췰"},
	{0xEE, u8"췸"},
	{0xEF, u8"췹"},
	{0xF0, u8"췻"},
	{0xF1, u8"췽"},
	{0xF2, u8"츄"},
	{0xF3, u8"츈"},
	{0xF4, u8"츌"},
	{0xF5, u8"츔"},
	{0xF6, u8"츙"},
	{0xF7, u8"츠"},
	{0xF8, u8"측"},
	{0xF9, u8"츤"},
	{0xFA, u8"츨"},
	{0xFB, u8"츰"},
	{0xFC, u8"츱"},
	{0xFD, u8"츳"},
	{0xFE, u8"층"}
};

static const TextCodePair gen2TextCodesKorean9[] = {
	{0x01, u8"치"},
	{0x02, u8"칙"},
	{0x03, u8"친"},
	{0x04, u8"칟"},
	{0x05, u8"칠"},
	{0x06, u8"칡"},
	{0x07, u8"침"},
	{0x08, u8"칩"},
	{0x09, u8"칫"},
	{0x0A, u8"칭"},
	{0x0B, u8"카"},
	{0x0C, u8"칵"},
	{0x0D, u8"칸"},
	{0x0E, u8"칼"},
	{0x0F, u8"캄"},
	{0x10, u8"캅"},
	{0x11, u8"캇"},
	{0x12, u8"캉"},
	{0x13, u8"캐"},
	{0x14, u8"캑"},
	{0x15, u8"캔"},
	{0x16, u8"캘"},
	{0x17, u8"캠"},
	{0x18, u8"캡"},
	{0x19, u8"캣"},
	{0x1A, u8"캤"},
	{0x1B, u8"캥"},
	{0x1C, u8"캬"},
	{0x1D, u8"캭"},
	{0x1E, u8"컁"},
	{0x1F, u8"커"},
	{0x20, u8"컥"},
	{0x21, u8"컨"},
	{0x22, u8"컫"},
	{0x23, u8"컬"},
	{0x24, u8"컴"},
	{0x25, u8"컵"},
	{0x26, u8"컷"},
	{0x27, u8"컸"},
	{0x28, u8"컹"},
	{0x29, u8"케"},
	{0x2A, u8"켁"},
	{0x2B, u8"켄"},
	{0x2C, u8"켈"},
	{0x2D, u8"켐"},
	{0x2E, u8"켑"},
	{0x2F, u8"켓"},
	{0x30, u8"켕"},
	{0x31, u8"켜"},
	{0x32, u8"켠"},
	{0x33, u8"켤"},
	{0x34, u8"켬"},
	{0x35, u8"켭"},
	{0x36, u8"켯"},
	{0x37, u8"켰"},
	{0x38, u8"켱"},
	{0x39, u8"켸"},
	{0x3A, u8"코"},
	{0x3B, u8"콕"},
	{0x3C, u8"콘"},
	{0x3D, u8"콜"},
	{0x3E, u8"콤"},
	{0x3F, u8"콥"},
	{0x40, u8"콧"},
	{0x41, u8"콩"},
	{0x42, u8"콰"},
	{0x43, u8"콱"},
	{0x44, u8"콴"},
	{0x45, u8"콸"},
	{0x46, u8"쾀"},
	{0x47, u8"쾅"},
	{0x48, u8"쾌"},
	{0x49, u8"쾡"},
	{0x4A, u8"쾨"},
	{0x4B, u8"쾰"},
	{0x4C, u8"쿄"},
	{0x4D, u8"쿠"},
	{0x4E, u8"쿡"},
	{0x4F, u8"쿤"},
	{0x60, u8"쿨"},
	{0x61, u8"쿰"},
	{0x62, u8"쿱"},
	{0x63, u8"쿳"},
	{0x64, u8"쿵"},
	{0x65, u8"쿼"},
	{0x66, u8"퀀"},
	{0x67, u8"퀄"},
	{0x68, u8"퀑"},
	{0x69, u8"퀘"},
	{0x6A, u8"퀭"},
	{0x6B, u8"퀴"},
	{0x6C, u8"퀵"},
	{0x6D, u8"퀸"},
	{0x6E, u8"퀼"},
	{0x71, u8"큄"},
	{0x72, u8"큅"},
	{0x73, u8"큇"},
	{0x74, u8"큉"},
	{0x75, u8"큐"},
	{0x76, u8"큔"},
	{0x77, u8"큘"},
	{0x78, u8"큠"},
	{0x79, u8"크"},
	{0x7A, u8"큭"},
	{0x7B, u8"큰"},
	{0x7C, u8"클"},
	{0x7D, u8"큼"},
	{0x7E, u8"큽"},
	{0x7F, u8"킁"},
	{0x80, u8"키"},
	{0x81, u8"킥"},
	{0x82, u8"킨"},
	{0x83, u8"킬"},
	{0x84, u8"킴"},
	{0x85, u8"킵"},
	{0x86, u8"킷"},
	{0x87, u8"킹"},
	{0x88, u8"타"},
	{0x89, u8"탁"},
	{0x8A, u8"탄"},
	{0x8B, u8"탈"},
	{0x8C, u8"탉"},
	{0x8D, u8"탐"},
	{0x8E, u8"탑"},
	{0x8F, u8"탓"},
	{0x90, u8"탔"},
	{0x91, u8"탕"},
	{0x92, u8"태"},
	{0x93, u8"택"},
	{0x94, u8"탠"},
	{0x95, u8"탤"},
	{0x96, u8"탬"},
	{0x97, u8"탭"},
	{0x98, u8"탯"},
	{0x99, u8"탰"},
	{0x9A, u8"탱"},
	{0x9B, u8"탸"},
	{0x9C, u8"턍"},
	{0x9D, u8"터"},
	{0x9E, u8"턱"},
	{0x9F, u8"턴"},
	{0xA0, u8"털"},
	{0xA1, u8"턺"},
	{0xA2, u8"텀"},
	{0xA3, u8"텁"},
	{0xA4, u8"텃"},
	{0xA5, u8"텄"},
	{0xA6, u8"텅"},
	{0xA7, u8"테"},
	{0xA8, u8"텍"},
	{0xA9, u8"텐"},
	{0xAA, u8"텔"},
	{0xAB, u8"템"},
	{0xAC, u8"텝"},
	{0xAD, u8"텟"},
	{0xAE, u8"텡"},
	{0xAF, u8"텨"},
	{0xB0, u8"텬"},
	{0xB1, u8"텼"},
	{0xB2, u8"톄"},
	{0xB3, u8"톈"},
	{0xB4, u8"토"},
	{0xB5, u8"톡"},
	{0xB6, u8"톤"},
	{0xB7, u8"톨"},
	{0xB8, u8"톰"},
	{0xB9, u8"톱"},
	{0xBA, u8"톳"},
	{0xBB, u8"통"},
	{0xBC, u8"톺"},
	{0xBD, u8"톼"},
	{0xBE, u8"퇀"},
	{0xBF, u8"퇘"},
	{0xC0, u8"퇴"},
	{0xC1, u8"퇸"},
	{0xC2, u8"툇"},
	{0xC3, u8"툉"},
	{0xC4, u8"툐"},
	{0xC5, u8"투"},
	{0xC6, u8"툭"},
	{0xC7, u8"툰"},
	{0xC8, u8"툴"},
	{0xC9, u8"툼"},
	{0xCA, u8"툽"},
	{0xCB, u8"툿"},
	{0xCC, u8"퉁"},
	{0xCD, u8"퉈"},
	{0xCE, u8"퉜"},
	{0xD1, u8"퉤"},
	{0xD2, u8"튀"},
	{0xD3, u8"튁"},
	{0xD4, u8"튄"},
	{0xD5, u8"튈"},
	{0xD6, u8"튐"},
	{0xD7, u8"튑"},
	{0xD8, u8"튕"},
	{0xD9, u8"튜"},
	{0xDA, u8"튠"},
	{0xDB, u8"튤"},
	{0xDC, u8"튬"},
	{0xDD, u8"튱"},
	{0xDE, u8"트"},
	{0xDF, u8"특"},
	{0xE0, u8"튼"},
	{0xE1, u8"튿"},
	{0xE2, u8"틀"},
	{0xE3, u8"틂"},
	{0xE4, u8"틈"},
	{0xE5, u8"틉"},
	{0xE6, u8"틋"},
	{0xE7, u8"틔"},
	{0xE8, u8"틘"},
	{0xE9, u8"틜"},
	{0xEA, u8"틤"},
	{0xEB, u8"틥"},
	{0xEC, u8"티"},
	{0xED, u8"틱"},
	{0xEE, u8"틴"},
	{0xEF, u8"틸"},
	{0xF0, u8"팀"},
	{0xF1, u8"팁"},
	{0xF2, u8"팃"},
	{0xF3, u8"팅"},
	{0xF4, u8"파"},
	{0xF5, u8"팍"},
	{0xF6, u8"팎"},
	{0xF7, u8"판"},
	{0xF8, u8"팔"},
	{0xF9, u8"팖"},
	{0xFA, u8"팜"},
	{0xFB, u8"팝"},
	{0xFC, u8"팟"},
	{0xFD, u8"팠"},
	{0xFE, u8"팡"},
	{0xFF, u8"팥"}
};

static const TextCodePair gen2TextCodesKoreanA[] = {
	{0x00, u8"패"},
	{0x01, u8"팩"},
	{0x02, u8"팬"},
	{0x03, u8"팰"},
	{0x04, u8"팸"},
	{0x05, u8"팹"},
	{0x06, u8"팻"},
	{0x07, u8"팼"},
	{0x08, u8"팽"},
	{0x09, u8"퍄"},
	{0x0A, u8"퍅"},
	{0x0B, u8"퍼"},
	{0x0C, u8"퍽"},
	{0x0D, u8"펀"},
	{0x0E, u8"펄"},
	{0x0F, u8"펌"},
	{0x10, u8"펍"},
	{0x11, u8"펏"},
	{0x12, u8"펐"},
	{0x13, u8"펑"},
	{0x14, u8"페"},
	{0x15, u8"펙"},
	{0x16, u8"펜"},
	{0x17, u8"펠"},
	{0x18, u8"펨"},
	{0x19, u8"펩"},
	{0x1A, u8"펫"},
	{0x1B, u8"펭"},
	{0x1C, u8"펴"},
	{0x1D, u8"편"},
	{0x1E, u8"펼"},
	{0x1F, u8"폄"},
	{0x20, u8"폅"},
	{0x21, u8"폈"},
	{0x22, u8"평"},
	{0x23, u8"폐"},
	{0x24, u8"폘"},
	{0x25, u8"폡"},
	{0x26, u8"폣"},
	{0x27, u8"포"},
	{0x28, u8"폭"},
	{0x29, u8"폰"},
	{0x2A, u8"폴"},
	{0x2B, u8"폼"},
	{0x2C, u8"폽"},
	{0x2D, u8"폿"},
	{0x2E, u8"퐁"},
	{0x31, u8"퐈"},
	{0x32, u8"퐝"},
	{0x33, u8"푀"},
	{0x34, u8"푄"},
	{0x35, u8"표"},
	{0x36, u8"푠"},
	{0x37, u8"푤"},
	{0x38, u8"푭"},
	{0x39, u8"푯"},
	{0x3A, u8"푸"},
	{0x3B, u8"푹"},
	{0x3C, u8"푼"},
	{0x3D, u8"푿"},
	{0x3E, u8"풀"},
	{0x3F, u8"풂"},
	{0x40, u8"품"},
	{0x41, u8"풉"},
	{0x42, u8"풋"},
	{0x43, u8"풍"},
	{0x44, u8"풔"},
	{0x45, u8"풩"},
	{0x46, u8"퓌"},
	{0x47, u8"퓐"},
	{0x48, u8"퓔"},
	{0x49, u8"퓜"},
	{0x4A, u8"퓟"},
	{0x4B, u8"퓨"},
	{0x4C, u8"퓬"},
	{0x4D, u8"퓰"},
	{0x4E, u8"퓸"},
	{0x4F, u8"퓻"},
	{0x60, u8"퓽"},
	{0x61, u8"프"},
	{0x62, u8"픈"},
	{0x63, u8"플"},
	{0x64, u8"픔"},
	{0x65, u8"픕"},
	{0x66, u8"픗"},
	{0x67, u8"피"},
	{0x68, u8"픽"},
	{0x69, u8"핀"},
	{0x6A, u8"필"},
	{0x6B, u8"핌"},
	{0x6C, u8"핍"},
	{0x6D, u8"핏"},
	{0x6E, u8"핑"},
	{0x6F, u8"하"},
	{0x70, u8"학"},
	{0x71, u8"한"},
	{0x72, u8"할"},
	{0x73, u8"핥"},
	{0x74, u8"함"},
	{0x75, u8"합"},
	{0x76, u8"핫"},
	{0x77, u8"항"},
	{0x78, u8"해"},
	{0x79, u8"핵"},
	{0x7A, u8"핸"},
	{0x7B, u8"핼"},
	{0x7C, u8"햄"},
	{0x7D, u8"햅"},
	{0x7E, u8"햇"},
	{0x7F, u8"했"},
	{0x80, u8"행"},
	{0x81, u8"햐"},
	{0x82, u8"향"},
	{0x83, u8"허"},
	{0x84, u8"헉"},
	{0x85, u8"헌"},
	{0x86, u8"헐"},
	{0x87, u8"헒"},
	{0x88, u8"험"},
	{0x89, u8"헙"},
	{0x8A, u8"헛"},
	{0x8B, u8"헝"},
	{0x8C, u8"헤"},
	{0x8D, u8"헥"},
	{0x8E, u8"헨"},
	{0x8F, u8"헬"},
	{0x90, u8"헴"},
	{0x91, u8"헵"},
	{0x92, u8"헷"},
	{0x93, u8"헹"},
	{0x94, u8"혀"},
	{0x95, u8"혁"},
	{0x96, u8"현"},
	{0x97, u8"혈"},
	{0x98, u8"혐"},
	{0x99, u8"협"},
	{0x9A, u8"혓"},
	{0x9B, u8"혔"},
	{0x9C, u8"형"},
	{0x9D, u8"혜"},
	{0x9E, u8"혠"},
	{0xA1, u8"혤"},
	{0xA2, u8"혭"},
	{0xA3, u8"호"},
	{0xA4, u8"혹"},
	{0xA5, u8"혼"},
	{0xA6, u8"홀"},
	{0xA7, u8"홅"},
	{0xA8, u8"홈"},
	{0xA9, u8"홉"},
	{0xAA, u8"홋"},
	{0xAB, u8"홍"},
	{0xAC, u8"홑"},
	{0xAD, u8"화"},
	{0xAE, u8"확"},
	{0xAF, u8"환"},
	{0xB0, u8"활"},
	{0xB1, u8"홧"},
	{0xB2, u8"황"},
	{0xB3, u8"홰"},
	{0xB4, u8"홱"},
	{0xB5, u8"홴"},
	{0xB6, u8"횃"},
	{0xB7, u8"횅"},
	{0xB8, u8"회"},
	{0xB9, u8"획"},
	{0xBA, u8"횐"},
	{0xBB, u8"횔"},
	{0xBC, u8"횝"},
	{0xBD, u8"횟"},
	{0xBE, u8"횡"},
	{0xBF, u8"효"},
	{0xC0, u8"횬"},
	{0xC1, u8"횰"},
	{0xC2, u8"횹"},
	{0xC3, u8"횻"},
	{0xC4, u8"후"},
	{0xC5, u8"훅"},
	{0xC6, u8"훈"},
	{0xC7, u8"훌"},
	{0xC8, u8"훑"},
	{0xC9, u8"훔"},
	{0xCA, u8"훗"},
	{0xCB, u8"훙"},
	{0xCC, u8"훠"},
	{0xCD, u8"훤"},
	{0xCE, u8"훨"},
	{0xCF, u8"훰"},
	{0xD0, u8"훵"},
	{0xD1, u8"훼"},
	{0xD2, u8"훽"},
	{0xD3, u8"휀"},
	{0xD4, u8"휄"},
	{0xD5, u8"휑"},
	{0xD6, u8"휘"},
	{0xD7, u8"휙"},
	{0xD8, u8"휜"},
	{0xD9, u8"휠"},
	{0xDA, u8"휨"},
	{0xDB, u8"휩"},
	{0xDC, u8"휫"},
	{0xDD, u8"휭"},
	{0xDE, u8"휴"},
	{0xDF, u8"휵"},
	{0xE0, u8"휸"},
	{0xE1, u8"휼"},
	{0xE2, u8"흄"},
	{0xE3, u8"흇"},
	{0xE4, u8"흉"},
	{0xE5, u8"흐"},
	{0xE6, u8"흑"},
	{0xE7, u8"흔"},
	{0xE8, u8"흖"},
	{0xE9, u8"흗"},
	{0xEA, u8"흘"},
	{0xEB, u8"흙"},
	{0xEC, u8"흠"},
	{0xED, u8"흡"},
	{0xEE, u8"흣"},
	{0xEF, u8"흥"},
	{0xF0, u8"흩"},
	{0xF1, u8"희"},
	{0xF2, u8"흰"},
	{0xF3, u8"흴"},
	{0xF4, u8"흼"},
	{0xF5, u8"흽"},
	{0xF6, u8"힁"},
	{0xF7, u8"히"},
	{0xF8, u8"힉"},
	{0xF9, u8"힌"},
	{0xFA, u8"힐"},
	{0xFB, u8"힘"},
	{0xFC, u8"힙"},
	{0xFD, u8"힛"},
	{0xFE, u8"힝"}
};

static const TextCodePair gen2TextCodesKoreanB[] = {
	{0x00, u8"ㄱ"},
	{0x01, u8"ㄴ"},
	{0x02, u8"ㄷ"},
	{0x03, u8"ㄹ"},
	{0x04, u8"ㅁ"},
	{0x05, u8"ㅂ"},
	{0x06, u8"ㅅ"},
	{0x07, u8"ㅇ"},
	{0x08, u8"ㅈ"},
	{0x09, u8"ㅊ"},
	{0x0A, u8"ㅋ"},
	{0x0B, u8"ㅌ"},
	{0x0C, u8"ㅍ"},
	{0x0D, u8"ㅎ"},
	{0x0E, u8"ㄲ"},
	{0x0F, u8"ㄸ"},
	{0x10, u8"ㅃ"},
	{0x11, u8"ㅆ"},
	{0x12, u8"ㅉ"},
	{0x20, u8"ㅏ"},
	{0x21, u8"ㅑ"},
	{0x22, u8"ㅓ"},
	{0x23, u8"ㅕ"},
	{0x24, u8"ㅗ"},
	{0x25, u8"ㅛ"},
	{0x26, u8"ㅜ"},
	{0x27, u8"ㅠ"},
	{0x28, u8"ㅡ"},
	{0x29, u8"ㅣ"},
	{0x2A, u8"ㅐ"},
	{0x2B, u8"ㅒ"},
	{0x2C, u8"ㅔ"},
	{0x2D, u8"ㅖ"},
	{0x2E, u8"ㅘ"},
	{0x2F, u8"ㅙ"},
	{0x30, u8"ㅚ"},
	{0x31, u8"ㅝ"},
	{0x32, u8"ㅞ"},
	{0x33, u8"ㅟ"},
	{0x34, u8"ㅢ"},
	{0x3E, u8"_"},
	{0x3F, u8"-"},
	{0x60, u8"「"},
	{0x61, u8"」"},
	{0x62, u8"『"},
	{0x63, u8"』"},
	{0x64, u8"("},
	{0x65, u8")"},
	{0x66, u8"!"},
	{0x67, u8"?"},
	{0x68, u8"-"},
	{0x69, u8"~"},
	{0x6A, u8"…"},
	{0x6B, u8","},
	{0x6C, u8"."},
	{0xF0, u8"0"},
	{0xF1, u8"1"},
	{0xF2, u8"2"},
	{0xF3, u8"3"},
	{0xF4, u8"4"},
	{0xF5, u8"5"},
	{0xF6, u8"6"},
	{0xF7, u8"7"},
	{0xF8, u8"8"},
	{0xF9, u8"9"}
};

static uint16_t decodeKoreanPokeText(const uint8_t *inputBuffer, uint16_t inputBufferLength, char *outputBuffer, uint16_t outputBufferLength)
{
	uint16_t result = 0;
	if(inputBufferLength > outputBufferLength)
	{
		return result;
	}

	const uint8_t* curInput = (const uint8_t*)inputBuffer;
	const uint8_t* endInput = curInput + inputBufferLength;
	uint8_t* curOutput = (uint8_t*)outputBuffer;
	uint16_t remainingBufferSpace = outputBufferLength;
	const struct TextCodePair* textCodes;
	uint16_t numTextCodes;

	const TextCodePair* charSets[] = {
		gen2TextCodesKorean0,
		gen2TextCodesKorean1,
		gen2TextCodesKorean2,
		gen2TextCodesKorean3,
		gen2TextCodesKorean4,
		gen2TextCodesKorean5,
		gen2TextCodesKorean6,
		gen2TextCodesKorean7,
		gen2TextCodesKorean8,
		gen2TextCodesKorean9,
		gen2TextCodesKoreanA,
		gen2TextCodesKoreanB
	};

	const uint16_t charSetNumChars[] = {
		sizeof(gen2TextCodesKorean0) / sizeof(TextCodePair),
		sizeof(gen2TextCodesKorean1) / sizeof(TextCodePair),
		sizeof(gen2TextCodesKorean2) / sizeof(TextCodePair),
		sizeof(gen2TextCodesKorean3) / sizeof(TextCodePair),
		sizeof(gen2TextCodesKorean4) / sizeof(TextCodePair),
		sizeof(gen2TextCodesKorean5) / sizeof(TextCodePair),
		sizeof(gen2TextCodesKorean6) / sizeof(TextCodePair),
		sizeof(gen2TextCodesKorean7) / sizeof(TextCodePair),
		sizeof(gen2TextCodesKorean8) / sizeof(TextCodePair),
		sizeof(gen2TextCodesKorean9) / sizeof(TextCodePair),
		sizeof(gen2TextCodesKoreanA) / sizeof(TextCodePair),
		sizeof(gen2TextCodesKoreanB) / sizeof(TextCodePair)
	};

	while(curInput < endInput)
	{
		if((*curInput) == 0x50)
		{
			break;
		}
		else if((*curInput) < 0xC)
		{
			// the current byte refers to the prefix of one of those additional Korean
			// character sets
			textCodes = charSets[(*curInput)];
			numTextCodes = charSetNumChars[(*curInput)];
			// The next input byte value refers to the offset in the character set
			++curInput;
		}
		else
		{
			// allright, the current byte instead refers to the actual offset
			// in the main character set.
			textCodes = gen2TextCodesMain;
			numTextCodes = sizeof(gen2TextCodesMain) / sizeof(TextCodePair);
		}

		const char* outputText = findCharsByTextCode(textCodes, numTextCodes, (*curInput));
		if(!outputText)
		{
			outputText = " ";
		}
		const size_t outputTextLength = strlen(outputText);

		if(remainingBufferSpace < outputTextLength + 1)
		{
			// not enough space left: truncated
			memcpy(curOutput, outputText, remainingBufferSpace - 1);
			outputBuffer[outputBufferLength -1] = '\0';
			return outputBufferLength - 1;
		}

		memcpy(curOutput, outputText, outputTextLength);
		curOutput += outputTextLength;
		result += outputTextLength;
		remainingBufferSpace -= outputTextLength;

		++curInput;
	}
	// terminator byte
	(*curOutput) = '\0';
	return result;
}

/**
 * This function determines whether the given byte is the first byte of a UTF8 character.
 * It does this by checking the first 2 bits for the 10 sequence.
 *
 * The first byte will NEVER have the first 2 bits set to 10, regardless of the number of bytes of the character.
 * But all subsequent bytes DO.
 *
 * https://www.quora.com/In-Unicode-UTF-8-how-do-we-know-the-start-and-the-end-of-a-character-since-characters-vary-in-length
 * https://en.wikipedia.org/wiki/UTF-8
 */
static bool isStartOfUTF8Character(uint8_t byte)
{
	return (byte & 0xC0) != 0x80;
}

/**
 * This function encodes a Korean text into the game-specific format using the available Korean character sets
 * https://bulbapedia.bulbagarden.net/wiki/Korean_character_encoding_(Generation_II)
 */
static uint16_t encodeKoreanPokeText(const char *inputBuffer, uint16_t inputBufferLength, uint8_t *outputBuffer, uint16_t outputBufferLength, uint8_t terminator)
{
	// a UTF8 encodes a character in 1-4 bytes. We'll reserve another one for the null terminator
	char singleChar[5];
	uint8_t byteCount = 0;
	const char* inCur = inputBuffer;
	const char* const inEnd = inputBuffer + inputBufferLength;
	uint8_t* outputCur = outputBuffer;
	uint8_t* const outputBufferEnd = outputBuffer + outputBufferLength;
	uint16_t needleLength;
	uint8_t code;
	uint8_t i;
	bool foundCode;

	// to avoid repeating the findTextcodeByString pattern below in an if-else structure
	// we'll just define a list of charsets and go through this list.
	const TextCodePair* charSets[] = {
		gen2TextCodesMain,
		gen2TextCodesKorean0,
		gen2TextCodesKorean1,
		gen2TextCodesKorean2,
		gen2TextCodesKorean3,
		gen2TextCodesKorean4,
		gen2TextCodesKorean5,
		gen2TextCodesKorean6,
		gen2TextCodesKorean7,
		gen2TextCodesKorean8,
		gen2TextCodesKorean9,
		gen2TextCodesKoreanA,
		gen2TextCodesKoreanB
	};

	const uint16_t charSetNumChars[] = {
		sizeof(gen2TextCodesMain)    / sizeof(TextCodePair),
		sizeof(gen2TextCodesKorean0) / sizeof(TextCodePair),
		sizeof(gen2TextCodesKorean1) / sizeof(TextCodePair),
		sizeof(gen2TextCodesKorean2) / sizeof(TextCodePair),
		sizeof(gen2TextCodesKorean3) / sizeof(TextCodePair),
		sizeof(gen2TextCodesKorean4) / sizeof(TextCodePair),
		sizeof(gen2TextCodesKorean5) / sizeof(TextCodePair),
		sizeof(gen2TextCodesKorean6) / sizeof(TextCodePair),
		sizeof(gen2TextCodesKorean7) / sizeof(TextCodePair),
		sizeof(gen2TextCodesKorean8) / sizeof(TextCodePair),
		sizeof(gen2TextCodesKorean9) / sizeof(TextCodePair),
		sizeof(gen2TextCodesKoreanA) / sizeof(TextCodePair),
		sizeof(gen2TextCodesKoreanB) / sizeof(TextCodePair)
	};

	// Yes, the = in the while condition is not a bug. We need it to deal with the last character
	// (I can't rely on the detection of a next character, but I don't want to repeat code)
	// it does mean that I'll have to be careful to deal with this use case (inCur == inEnd) properly. I should make sure not to go out of bounds
	while(inCur <= inEnd)
	{
		// There are 3 cases to deal with here:
		// - the current byte is the first byte of the string
		// - the current byte is the first byte of the next utf8 character (meaning we fully copied all bytes of the previous one)
		// - we're actually at the end of the inputBuffer. But we still need to process the last character.
		//
		// In 2nd and 3rd case, we can start looking up the textcode of the previous char (contained in singleChar) and add it to the outputBuffer
		if(((inCur == inEnd) || isStartOfUTF8Character(*inCur)) && byteCount)
		{
			// We copied a complete utf8 character into singleChar
			// now we can try finding it
			singleChar[byteCount] = '\0';
			foundCode = false;

			// try to find the character in all the relevant charsets.
			for(i = 0; i < sizeof(charSetNumChars) / sizeof(uint16_t); ++i)
			{
				if(findTextcodeByString(charSets[i], charSetNumChars[i], singleChar, byteCount, code, needleLength))
				{
					// if i > 0, then it means the character was not found in the main charset.
					// Therefore we need to insert the index - 1 into the output. The -1 is needed because
					// the to-be-inserted index byte only refers to the index of gen2TextCodesKoreanX charsets. So gen2TextCodesMain should not be included.
					if(i)
					{
						(*outputCur) = i - 1;
						++outputCur;
					}
					(*outputCur) = code;
					++outputCur;
					foundCode = true;
					break;
				}
			}

			byteCount = 0;

			if(!foundCode)
			{
				// many empty spots in the korean character maps end up outputting a space character.
				// however, for most dialog, 0x7F is used to represent a space.
				// And for player input, 0x0B 0xFF is used to represent a space.
				// in our code, we assume the latter use case if we can't find a textCode
				// source: https://bulbapedia.bulbagarden.net/wiki/Korean_character_encoding_(Generation_II)
				(*outputCur) = 0x0B;
				++outputCur;
				(*outputCur) = 0xFF;
				++outputCur;
			}

			if(inCur == inEnd)
			{
				// allright, we dealt with the last character in the input string. There are no more characters, so
				// we need to bail out of the while loop before we end up dereferencing inCur while being out of bounds
				break;
			}

			// We stop trying to process input if we don't have any space left in our outputBuffer
			// This is not entirely foolproof because we aren't checking this for every to-be-inserted byte.
			// so in case the code above ends up inserting 2 bytes while we only have room for 1, we'll go out of bounds.
			// For security reasons this might be problematic. However, I don't expect us to use this function for processing
			// actual user input. Instead I think it might just be used to look up some strings we expect in the rom.
			// So I don't think we need to care much about it.
			// TODO: revisit this if it turns out to be a problem.
			if(outputCur >= outputBufferEnd)
			{
				break;
			}
		}
		singleChar[byteCount] = *inCur;
		++inCur;
		++byteCount;
	}
	// if there's room for a terminator, add it.
	if(outputCur < outputBufferEnd)
	{
		(*outputCur) = terminator;
		// for consistency, we need to include the terminator in the byte count returned
		++outputCur;
	}
	return static_cast<uint16_t>(outputCur - outputBuffer);
}

Gen2ItemList::Gen2ItemList(ISaveManager &saveManager, Gen2ItemListType type, Gen2GameType gameType, Gen2LocalizationLanguage localization)
	: saveManager_(saveManager)
	, type_(type)
	, gameType_(gameType)
	, localization_(localization)
{
}

uint8_t Gen2ItemList::getCount()
{
	uint8_t result;
	if (!seekToBasePos())
	{
		return 0;
	}

	if (!saveManager_.readByte(result))
	{
		result = 0;
	}
	return result;
}

uint8_t Gen2ItemList::getCapacity()
{
	return (type_ == Gen2ItemListType::GEN2_ITEMLISTTYPE_KEYITEMPOCKET) ? 26 : 20;
}

bool Gen2ItemList::getEntry(uint8_t index, uint8_t &outItemId, uint8_t &outCount)
{
	if (!seekToBasePos())
	{
		return false;
	}

	// It looks like the key item pocket doesn't have a count value.
	// During my test if I try to write a GS ball with count 1 to crystal and store the count value, I get a random master ball showing up (which has itemId 1)
	// before the gs ball in the list.
	const uint32_t advanceAmount = (type_ == Gen2ItemListType::GEN2_ITEMLISTTYPE_KEYITEMPOCKET) ? 1 + index : 1 + (index * 2);
	if (!saveManager_.advance(advanceAmount))
	{
		return false;
	}

	return getNextEntry(outItemId, outCount);
}

bool Gen2ItemList::getNextEntry(uint8_t &outItemId, uint8_t &outCount)
{
	const uint8_t peekByte = saveManager_.peek();

	// 0xFF is the terminator byte
	if(peekByte == 0xFF)
	{
		return false;
	}

	// 2 things here:
	// - The bulbapedia article: https://bulbapedia.bulbagarden.net/wiki/Save_data_structure_(Generation_II)#Item_lists
	//   gets the order of count vs itemId wrong. At least during my tests with a Pokémon crystal AND gold save
	// - The key item pocket doesn't appear to store a count value at all.
	//   see my other comment at ::getEntry() for more info
	saveManager_.readByte(outItemId);
	if(type_ != Gen2ItemListType::GEN2_ITEMLISTTYPE_KEYITEMPOCKET)
	{
		saveManager_.readByte(outCount);
	}
	else
	{
		outCount = 1;
	}

	return true;
}

bool Gen2ItemList::add(uint8_t itemId, uint8_t itemCount)
{
	uint8_t curItemId;
	uint8_t curItemCount;
	const uint8_t numItems = getCount();
	
	// search for an existing item entry
	// if found, we'll increase the itemcount
	// if not found, the internal position of the savemanager will have conveniently moved
	// to the position we'd actually need to write the new entry to
	while(getNextEntry(curItemId, curItemCount))
	{
		if(curItemId == itemId)
		{
			// the key item pocket doesn't appear to have a count field per entry.
			// For more info see the related comment @getEntry()
			if(type_ != Gen2ItemListType::GEN2_ITEMLISTTYPE_KEYITEMPOCKET)
			{
				uint8_t newCount = curItemCount + itemCount;
				if(newCount > 99)
				{
					newCount = 99;
				}
				saveManager_.rewind(1); // count is the second field of each entry (yes, Bulbapedia appears to get it wrong here)
				saveManager_.writeByte(newCount);
				saveManager_.advance();
			}
			return true;
		}
	}

	// no existing entry found in the itemlist
	// first check if there's any room left for the new item
	if(numItems >= getCapacity())
	{
		return false;
	}
	
	// Bulbapedia gets the order wrong here. itemId should go first, then itemCount
	// at least this is the case during my tests with a Pokémon Crystal AND Gold save
	saveManager_.writeByte(itemId);
	// in the while loop, getNextEntry has returned false on the last iteration, so that means
	// we've arrived at the terminator of the list. This is the exact position at which we need to write our new entry.
	// convenient, isn't it?
	// so let's write the new entry...
	if(type_ != Gen2ItemListType::GEN2_ITEMLISTTYPE_KEYITEMPOCKET)
	{
		// the key item pocket doesn't appear to have a count field per entry.
		// For more info see the related comment @getEntry()
		saveManager_.writeByte(itemCount);
	}
	// now write the new terminator
	saveManager_.writeByte(0xFF);

	// the only thing left is to increase the list counter
	seekToBasePos();
	saveManager_.writeByte(numItems + 1);
	
	return true;
}

bool Gen2ItemList::remove(uint8_t itemId)
{
	uint8_t curItemId;
	uint8_t curItemCount;

	const uint8_t numItems = getCount();

	// search for an existing item entry
	// if found, we'll increase the itemcount
	// if not found, the internal position of the savemanager will have conveniently moved
	// to the position we'd actually need to write the new entry to
	while(getNextEntry(curItemId, curItemCount))
	{
		if(curItemId == itemId)
		{
			break;
		}
	}

	if(curItemId != itemId)
	{
		return false;
	}

	while(getNextEntry(curItemId, curItemCount))
	{
		// okay, we need to rewind to the item we want to replace first. right now we're just past the item we just read to replace it with
		if(type_ != Gen2ItemListType::GEN2_ITEMLISTTYPE_KEYITEMPOCKET)
		{
			saveManager_.rewind(4);
		}
		else
		{
			// the key item pocket doesn't appear to have a count field per entry.
			saveManager_.rewind(2);
		}
		saveManager_.writeByte(curItemId);
		if(type_ != Gen2ItemListType::GEN2_ITEMLISTTYPE_KEYITEMPOCKET)
		{
			// the key item pocket doesn't appear to have a count field per entry.
			// For more info see the related comment @getEntry()
			saveManager_.writeByte(curItemCount);
		}

		// now we need to advance 1 item to make sure we're not reading the same entry again on the next loop
		if(type_ != Gen2ItemListType::GEN2_ITEMLISTTYPE_KEYITEMPOCKET)
		{
			saveManager_.advance(2);
		}
		else
		{
			// the key item pocket doesn't appear to have a count field per entry.
			saveManager_.advance(1);
		}
	}

	if(type_ != Gen2ItemListType::GEN2_ITEMLISTTYPE_KEYITEMPOCKET)
	{
		saveManager_.rewind(2);
	}
	else
	{
		saveManager_.rewind(1);
	}

	// now write the new terminator
	saveManager_.writeByte(0xFF);

	// the only thing left is to increase the list counter
	seekToBasePos();
	saveManager_.writeByte(numItems - 1);

	return true;
}

bool Gen2ItemList::seekToBasePos()
{
	uint32_t offset;
	const Gen2LocalizationSRAMOffsets& sramOffsets = gen2_getSRAMOffsets(gameType_, localization_);
	switch (type_)
	{
	case GEN2_ITEMLISTTYPE_TMHM:
		offset = sramOffsets.itemPocketTMHM;
		break;
	case GEN2_ITEMLISTTYPE_ITEMPOCKET:
		offset = sramOffsets.itemPocketItem;
		break;
	case GEN2_ITEMLISTTYPE_KEYITEMPOCKET:
		offset = sramOffsets.itemPocketKey;
		break;
	case GEN2_ITEMLISTTYPE_BALLPOCKET:
		offset = sramOffsets.itemPocketBall;
		break;
	case GEN2_ITEMLISTTYPE_PC:
		offset = sramOffsets.itemPocketPC;
		break;
	default:
		return false;
	}

	return saveManager_.seek(offset);
}

Gen2Checksum::Gen2Checksum()
	: checksum_(0)
{
}

void Gen2Checksum::addByte(uint8_t byte)
{
	checksum_ += byte;
}

uint16_t Gen2Checksum::get() const
{
	return checksum_;
}

Gen2GameType gen2_determineGameType(const GameboyCartridgeHeader& cartridgeHeader)
{
	Gen2GameType result;
	if (strncmp(cartridgeHeader.title, POKEMON_GOLD_CARTRIDGE_TITLE, sizeof(POKEMON_GOLD_CARTRIDGE_TITLE) - 1) == 0)
    {
        result = Gen2GameType::GOLD;
    }
    else if (strncmp(cartridgeHeader.title, POKEMON_SILVER_CARTRIDGE_TITLE, sizeof(POKEMON_SILVER_CARTRIDGE_TITLE) - 1) == 0)
    {
        result = Gen2GameType::SILVER;
    }
    else if (strncmp(cartridgeHeader.title, POKEMON_CRYSTAL_CARTRIDGE_TITLE, sizeof(POKEMON_CRYSTAL_CARTRIDGE_TITLE) - 1) == 0)
    {
        result = Gen2GameType::CRYSTAL;
    }
	else
	{
		result = Gen2GameType::INVALID;
	}
	return result;
}

Gen2LocalizationLanguage gen2_determineGameLanguage(IRomReader& romReader, Gen2GameType gameType)
{
	// The pokemon index-to-pokedex-number map has a unique rom offset in each of the game localizations.
	// It also should have the exact same data in all gen 1 games and all of their localizations.
	// Therefore we can use a fingerprint byte pattern to check these locations to figure out which localization we have.
	uint8_t buffer[sizeof(gen2_statsFingerPrint)];

	for(uint8_t i=0; i < static_cast<uint8_t>(Gen2LocalizationLanguage::MAX); ++i)
	{
		const Gen2LocalizationRomOffsets& romOffsetList = gen2_getRomOffsets(gameType, (Gen2LocalizationLanguage)i);
		romReader.seek(romOffsetList.stats);
		romReader.read(buffer, sizeof(gen2_statsFingerPrint));
		if(memcmp(buffer, gen2_statsFingerPrint, sizeof(gen2_statsFingerPrint)) == 0)
		{
			// stats fingerprint match at the current languages' stats offset.

			// For pokémon gold & pokémon silver, however, the spanish and italian localizations use the exact same stats rom offset.
			// The only difference we can really check for -given the rom offsets we possess right now- is the names offset.
			// that's the only one that is unique for these
			// both of these games use the original English names though. So it's just a matter of the offsets being different
			if(gameType != Gen2GameType::CRYSTAL && (i == (uint8_t)Gen2LocalizationLanguage::ITALIAN || i == (uint8_t)Gen2LocalizationLanguage::SPANISH))
			{
				uint8_t nameBuffer[0xB];
				const char* firstPokemon = "BULBASAUR";
				// both languages are luckily also using our main character set. So we don't have to worry about that
				const uint16_t nameLength = gen2_encodePokeText(firstPokemon, strlen(firstPokemon), nameBuffer, sizeof(nameBuffer), 0x50);

				romReader.seek(romOffsetList.names);
				romReader.read(buffer, nameLength);

				const int ret = memcmp(buffer, nameBuffer, nameLength - 1);
				if(ret != 0)
				{
					// no match at the current offset. Skip to the next language
					continue;
				}
				// if we get here, we have a full match. So we know which language we're dealing with now!
				// Therefore we will end up at the return statement below
			}
			return (Gen2LocalizationLanguage)i;
		}
	}

	return Gen2LocalizationLanguage::MAX;
}

void gen2_recalculatePokeStats(Gen2GameReader &reader, Gen2TrainerPokemon &poke)
{
	Gen2PokeStats stats;
	reader.readPokemonStatsForIndex(poke.poke_index, stats);

	poke.max_hp = calculatePokeStat(PokeStat::HP, stats.base_hp, getStatIV(PokeStat::HP, poke.iv_data), poke.hp_effort_value, poke.level);
	poke.atk = calculatePokeStat(PokeStat::ATK, stats.base_attack, getStatIV(PokeStat::ATK, poke.iv_data), poke.atk_effort_value, poke.level);
	poke.def = calculatePokeStat(PokeStat::DEF, stats.base_defense, getStatIV(PokeStat::DEF, poke.iv_data), poke.def_effort_value, poke.level);
	poke.speed = calculatePokeStat(PokeStat::SPEED, stats.base_speed, getStatIV(PokeStat::SPEED, poke.iv_data), poke.speed_effort_value, poke.level);
	poke.special_atk = calculatePokeStat(PokeStat::SPECIAL_ATK, stats.base_special_attack, getStatIV(PokeStat::SPECIAL_ATK, poke.iv_data), poke.special_effort_value, poke.level);
	poke.special_def = calculatePokeStat(PokeStat::SPECIAL_DEF, stats.base_special_defense, getStatIV(PokeStat::SPECIAL_DEF, poke.iv_data), poke.special_effort_value, poke.level);
}

uint16_t gen2_decodePokeText(const uint8_t *inputBuffer, uint16_t inputBufferLength, char *outputBuffer, uint16_t outputBufferLength, Gen2LocalizationLanguage language)
{
	const TextCodePair* textCodes;
	uint16_t numEntries;

	switch(language)
	{
	case Gen2LocalizationLanguage::KOREAN:
		return decodeKoreanPokeText(inputBuffer, inputBufferLength, outputBuffer, outputBufferLength);
	case Gen2LocalizationLanguage::JAPANESE:
		textCodes = gen2TextCodesJpn;
		numEntries = sizeof(gen2TextCodesJpn) / sizeof(struct TextCodePair);
		break;
	default:
		textCodes = gen2TextCodesMain;
		numEntries = sizeof(gen2TextCodesMain) / sizeof(struct TextCodePair);
	}

	return decodeText(textCodes, numEntries, inputBuffer, inputBufferLength, outputBuffer, outputBufferLength);
}

uint16_t gen2_encodePokeText(const char *inputBuffer, uint16_t inputBufferLength, uint8_t *outputBuffer, uint16_t outputBufferLength, uint8_t terminator, Gen2LocalizationLanguage language)
{
	const TextCodePair* textCodes;
	uint16_t numEntries;

	switch(language)
	{
	case Gen2LocalizationLanguage::KOREAN:
		return encodeKoreanPokeText(inputBuffer, inputBufferLength, outputBuffer, outputBufferLength, terminator);
	case Gen2LocalizationLanguage::JAPANESE:
		textCodes = gen2TextCodesJpn;
		numEntries = sizeof(gen2TextCodesJpn) / sizeof(struct TextCodePair);
		break;
	default:
		textCodes = gen2TextCodesMain;
		numEntries = sizeof(gen2TextCodesMain) / sizeof(struct TextCodePair);
		break;
	}

	return encodeText(textCodes, numEntries, inputBuffer, inputBufferLength, outputBuffer, outputBufferLength, terminator);
}

bool gen2_isPokemonShiny(Gen2TrainerPokemon& poke)
{
    // based on https://bulbapedia.bulbagarden.net/wiki/Shiny_Pok%C3%A9mon#Determining_Shininess
    const PokeStat statsToCheckFor10[] = {PokeStat::SPEED, PokeStat::DEF, PokeStat::SPECIAL};

    for(uint8_t i=0; i < (sizeof(statsToCheckFor10) / sizeof(statsToCheckFor10[0])); ++i)
    {
        if(getStatIV(statsToCheckFor10[i], poke.iv_data) != 10)
        {
            return false;
        }
    }

    switch(getStatIV(PokeStat::ATK, poke.iv_data))
    {
        case 2:
        case 3:
        case 6:
        case 7:
        case 10:
        case 11:
        case 14:
        case 15:
            return true;
        default:
            break;
    }
    return false;
}

void gen2_makePokemonShiny(Gen2TrainerPokemon& poke)
{
	const uint8_t validAtkValues[] = { 2, 3, 6, 7, 10, 11, 14, 15 };
	uint8_t i;
	bool atkValid = false;

	uint8_t atkIV = getStatIV(PokeStat::ATK, poke.iv_data);
	
	for(i=0; i < sizeof(validAtkValues); ++i)
	{
		if(atkIV == validAtkValues[i])
		{
			atkValid = true;
			break;
		}
	}

	if(!atkValid)
	{
		i = rand() % sizeof(validAtkValues);
		atkIV = validAtkValues[i];
	}

	// the first 4 bits need to be the valid atk IV (one of the validAtkValues list values)
	// all the other groups of 4 bits need to be set to 10 (SPEED, DEFENSE, SPECIAL)
	poke.iv_data[0] = (atkIV << 4) | 0xA;
	poke.iv_data[1] = 0xAA;
}

const char* gen2_getItemListTypeString(Gen2ItemListType type)
{
	switch(type)
	{
		case Gen2ItemListType::GEN2_ITEMLISTTYPE_TMHM:
			return "TM/HM Pocket";
		case Gen2ItemListType::GEN2_ITEMLISTTYPE_ITEMPOCKET:
			return "Item Pocket";
		case Gen2ItemListType::GEN2_ITEMLISTTYPE_KEYITEMPOCKET:
			return "Key Item Pocket";
		case Gen2ItemListType::GEN2_ITEMLISTTYPE_BALLPOCKET:
			return "Ball Pocket";
		case Gen2ItemListType::GEN2_ITEMLISTTYPE_PC:
			return "PC";
		default:
			return "Invalid";
	}
}

void gen2_prepareDistributionPokemon(Gen2GameReader& gameReader, const Gen2DistributionPokemon& distributionPoke, Gen2TrainerPokemon& poke, const char*& originalTrainerName)
{
    if (distributionPoke.setPlayerAsOriginalTrainer)
    {
        originalTrainerName = gameReader.getTrainerName();
        poke.original_trainer_ID = gameReader.getTrainerID();
    }
    else
    {
		const Gen2LocalizationLanguage gameLang = gameReader.getGameLanguage();

		if(gameLang == Gen2LocalizationLanguage::JAPANESE && !distributionPoke.isJapanese)
		{
			// The Japanese games don't have all the latin characters in their character set.
			// So if transferring a non-japanese distribution event pokémon to a japanese cartridge,
			// we need to replace the OT.
			// If Google Translate is any reliable, ポケメ64 should translate to "Pokeme 64".
			originalTrainerName = "ポケメ64";
		}
		else if(gameLang != Gen2LocalizationLanguage::JAPANESE && distributionPoke.isJapanese)
		{
			// Obviously non-japanese cartridges/roms don't have the japanese characters in their character set.
			// So if transferring a japanese distribution event pokémon to a non-japanese cartridge,
			// we need to replace the OT.
			// We'll replace it with PM64
			originalTrainerName = "PM64";
		}
		else
		{
			originalTrainerName = distributionPoke.originalTrainer;
		}

        if (distributionPoke.regenerateTrainerID)
        {
            if (distributionPoke.originalTrainerID)
            {
                // limit set, apply it
                poke.original_trainer_ID = (uint16_t)(rand() % distributionPoke.originalTrainerID);
            }
            else
            {
                // no limit. The max is the max of the uint16_t type
                poke.original_trainer_ID = (uint16_t)(rand() % UINT16_MAX);
            }
        }
        else
        {
            poke.original_trainer_ID = distributionPoke.originalTrainerID;
        }
    }

    if (distributionPoke.shinyChance != 0xFF && (rand() % 100) <= distributionPoke.shinyChance)
    {
        // the pokemon will be shiny
        gen2_makePokemonShiny(poke);
    }
    else if (distributionPoke.randomizeIVs)
    {
        const uint16_t randomVal = (uint16_t)rand();
        poke.iv_data[0] = (uint8_t)(randomVal >> 8);
        poke.iv_data[1] = (uint8_t)(randomVal & 0xFF);
    }
    else
    {
        poke.iv_data[0] = distributionPoke.iv_data[0];
        poke.iv_data[1] = distributionPoke.iv_data[1];
    }
}

uint16_t gen2_convertDecorationIDIntoEventFlag(uint8_t decorationID)
{
	const uint16_t DECORATION_EVENTFLAG_INDEX_OFFSET = 676;
	uint8_t correction;

	// sequence break in event flags vs decoration ids.
	// the big dolls are at the end
	switch(decorationID)
	{
	case 26:
		return 719; // BIG SNORLAX DOLL
	case 27:
		return 720; // BIG ONIX
	case 28:
		return 721; // BIG LAPRAS
	case 51:
		return 717; // GOLD TROPHY
	case 52:
		return 718; // SILVER TROPHY
	default:
		break;
	}

	// The correction variable is based on the grayed out "Put it away" rows here:
	// https://bulbapedia.bulbagarden.net/wiki/List_of_decorations_in_Generation_II
	// and the fact that the IDs start at index 1
	if(decorationID < 6)
	{
		correction = 2;
	}
	else if(decorationID < 11)
	{
		correction = 3;
	}
	else if(decorationID < 15)
	{
		correction = 4;
	}
	else if(decorationID < 20)
	{
		// In the flags, there were 4 plants reserved. But there are only 3
		// not only that, but the town map isn't reserved in the flags either
		correction = 5;
	}
	else if(decorationID < 25)
	{
		correction = 6;
	}
	else if(decorationID < 29)
	{
		// should not happen.
		// There's a sequence break in regards to the big dolls in the event flags.
		// The big dolls appear at the end instead of in sequence of the decoration IDS.
		correction = 0;
	}
	else
	{
		// because of the sequence break of the big dolls which do not appear in sequence in the event flags
		// the correction becomes much larger here.
		correction = 11;
	}

	return DECORATION_EVENTFLAG_INDEX_OFFSET + (decorationID - correction);
}